/*
Navicat MySQL Data Transfer

Source Server         : 127.0.0.1
Source Server Version : 50635
Source Host           : 127.0.0.1:3306
Source Database       : daily_report

Target Server Type    : MYSQL
Target Server Version : 50635
File Encoding         : 65001

Date: 2019-11-22 17:43:28
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `t_calendar`
-- ----------------------------
DROP TABLE IF EXISTS `t_calendar`;
CREATE TABLE `t_calendar` (
  `d_date` varchar(8) NOT NULL COMMENT '自然日日期',
  `c_type` varchar(1) DEFAULT NULL COMMENT '是否为工作日 0-工作日 1-假日 2-节日',
  `c_typename` varchar(10) DEFAULT NULL COMMENT '日期描述',
  `c_yearname` varchar(4) DEFAULT NULL COMMENT '年份',
  `c_nonglicn` varchar(10) DEFAULT NULL COMMENT '农历',
  `c_nongli` varchar(10) DEFAULT NULL COMMENT '农历月份',
  `c_animals_year` varchar(2) DEFAULT NULL COMMENT '生肖年',
  `c_throttle` varchar(10) DEFAULT NULL COMMENT '节气',
  `c_weekcn` varchar(2) DEFAULT NULL COMMENT '周-中文',
  `c_week1` varchar(6) DEFAULT NULL COMMENT '周期英文缩写',
  `c_week2` varchar(2) DEFAULT NULL COMMENT '周期数字',
  `c_week3` varchar(10) DEFAULT NULL COMMENT '周期英文',
  `c_daynum` varchar(4) DEFAULT NULL COMMENT '天数',
  `c_weeknum` varchar(4) DEFAULT NULL COMMENT '周数',
  `c_suit` varchar(200) DEFAULT NULL COMMENT '宜',
  `c_avoid` varchar(200) DEFAULT NULL COMMENT '忌',
  `c_desc` varchar(200) DEFAULT NULL COMMENT '假日描述',
  PRIMARY KEY (`d_date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_calendar
-- ----------------------------
INSERT INTO `t_calendar` VALUES ('20200101', '2', '节日', '己亥', '腊月初七', '11-7', '猪', '冬至后', '三', 'Wed', '3', 'Wednesday', '0', '01', '平治道涂.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200102', '0', '工作日', '己亥', '腊月初八', '11-8', '猪', '冬至后', '四', 'Thu', '4', 'Thursday', '1', '01', '求嗣.斋醮.塑绘.订盟.纳采.出火.拆卸.修造.动土.造桥.安机械.栽种.纳畜.牧养.入殓.除服.成服.移柩.破土.安葬', '开市.嫁娶', null);
INSERT INTO `t_calendar` VALUES ('20200103', '0', '工作日', '己亥', '腊月初九', '11-9', '猪', '冬至后', '五', 'Fri', '5', 'Friday', '2', '01', '嫁娶.订盟.纳采.祭祀.祈福.修造.动土.移徙.入宅', '开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200104', '1', '假日', '己亥', '腊月初十', '11-10', '猪', '冬至后', '六', 'Sat', '6', 'Saturday', '3', '01', '治病.破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200105', '1', '假日', '己亥', '腊月十一', '11-11', '猪', '冬至后', '日', 'Sun', '7', 'Sunday', '4', '01', '祭祀.祈福.求嗣.斋醮.开光.入学.订盟.冠笄.伐木.修造.动土.起基.放水.交易.开池', '造桥.安门.理发.造庙.栽种.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200106', '0', '工作日', '己亥', '腊月十二', '11-12', '猪', '小寒', '一', 'Mon', '1', 'Monday', '5', '02', '沐浴.开仓.出货财.开市.交易.立券.纳财.栽种.纳畜.牧养.畋猎.入殓.破土.安葬', '祈福.嫁娶.安床.入宅.造船', null);
INSERT INTO `t_calendar` VALUES ('20200107', '0', '工作日', '己亥', '腊月十三', '11-13', '猪', '小寒后', '二', 'Tue', '2', 'Tuesday', '6', '02', '祭祀.沐浴.补垣.塞穴.断蚁.解除.余事勿取', '造庙.入宅.修造.安葬.行丧.嫁娶', null);
INSERT INTO `t_calendar` VALUES ('20200108', '0', '工作日', '己亥', '腊月十四', '11-14', '猪', '小寒后', '三', 'Wed', '3', 'Wednesday', '7', '02', '嫁娶.纳采.订盟.问名.祭祀.冠笄.裁衣.会亲友.进人口.纳财.捕捉.作灶', '开市.安床.安葬.修坟', null);
INSERT INTO `t_calendar` VALUES ('20200109', '0', '工作日', '己亥', '腊月十五', '11-15', '猪', '小寒后', '四', 'Thu', '4', 'Thursday', '8', '02', '订盟.纳采.会亲友.祭祀.斋醮.沐浴.塑绘.出火.开光.竖柱.上梁.开市.交易.立券.作梁.开柱眼.伐木.架马.安门.安床.拆卸.牧养.造畜椆栖.掘井', '造庙.嫁娶.出行.动土.安葬.行丧', null);
INSERT INTO `t_calendar` VALUES ('20200110', '0', '工作日', '己亥', '腊月十六', '11-16', '猪', '小寒后', '五', 'Fri', '5', 'Friday', '9', '02', '交易.立券.纳财.安床.裁衣.造畜椆栖.安葬.谢土.启攒.除服.成服.修坟.立碑.移柩.入殓', '开光.嫁娶.开市.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200111', '1', '假日', '己亥', '腊月十七', '11-17', '猪', '小寒后', '六', 'Sat', '6', 'Saturday', '10', '02', '祭祀.解除.教牛马.会亲友.余事勿取', '破土.动土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200112', '1', '假日', '己亥', '腊月十八', '11-18', '猪', '小寒后', '日', 'Sun', '7', 'Sunday', '11', '02', '纳采.订盟.移徙.纳财.开市.交易.立券.入宅.会亲友.解除.求医.治病.入学.安床.安门.安香.出火.拆卸.扫舍.入宅.挂匾.开生坟.合寿木.破土.修坟.启攒.入殓', '探病.祭祀.出行.上梁.造屋.谢土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200113', '0', '工作日', '己亥', '腊月十九', '11-19', '猪', '小寒后', '一', 'Mon', '1', 'Monday', '12', '03', '嫁娶.订盟.纳采.祭祀.祈福.求嗣.会亲友.解除.出行.入学.纳财.开市.交易.立券.习艺.经络.安床.开仓.出货财.纳畜.安葬.启攒.修坟.入殓', '入宅.开光.开市.动土', null);
INSERT INTO `t_calendar` VALUES ('20200114', '0', '工作日', '己亥', '腊月二十', '11-20', '猪', '小寒后', '二', 'Tue', '2', 'Tuesday', '13', '03', '祭祀.冠笄.嫁娶.会亲友.进人口.裁衣.结网.平治道涂', '移徙.入宅.造庙.作灶.治病.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200115', '0', '工作日', '己亥', '腊月廿一', '11-21', '猪', '小寒后', '三', 'Wed', '3', 'Wednesday', '14', '03', '祭祀.安碓硙.结网.余事勿取', '嫁娶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200116', '0', '工作日', '己亥', '腊月廿二', '11-22', '猪', '小寒后', '四', 'Thu', '4', 'Thursday', '15', '03', '嫁娶.祭祀.沐浴.裁衣.出行.理发.移徙.捕捉.畋猎.放水.入宅.除服.成服.启攒.安葬.移柩.入殓', '造屋.开市.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200117', '0', '工作日', '己亥', '腊月廿三', '11-23', '猪', '小寒后', '五', 'Fri', '5', 'Friday', '16', '03', '破屋.坏垣.余事勿取', '嫁娶.开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200118', '1', '假日', '己亥', '腊月廿四', '11-24', '猪', '小寒后', '六', 'Sat', '6', 'Saturday', '17', '03', '纳采.订盟.祭祀.求嗣.出火.塑绘.裁衣.会亲友.入学.拆卸.扫舍.造仓.挂匾.掘井.开池.结网.栽种.纳畜.破土.修坟.立碑.安葬.入殓', '祈福.嫁娶.造庙.安床.谢土', null);
INSERT INTO `t_calendar` VALUES ('20200119', '0', '工作日', '己亥', '腊月廿五', '11-25', '猪', '小寒后', '日', 'Sun', '7', 'Sunday', '18', '03', '入殓.除服.成服.移柩.启攒.安葬.修坟.立碑', '开市.伐木.嫁娶.作梁', null);
INSERT INTO `t_calendar` VALUES ('20200120', '0', '工作日', '己亥', '腊月廿六', '11-26', '猪', '大寒', '一', 'Mon', '1', 'Monday', '19', '04', '祭祀.作灶.入殓.除服.余事勿取', '开市.安床', null);
INSERT INTO `t_calendar` VALUES ('20200121', '0', '工作日', '己亥', '腊月廿七', '11-27', '猪', '大寒后', '二', 'Tue', '2', 'Tuesday', '20', '04', '塑绘.开光.沐浴.冠笄.会亲友.作灶.放水.造畜椆栖', '嫁娶.入殓.安葬.出行', null);
INSERT INTO `t_calendar` VALUES ('20200122', '0', '工作日', '己亥', '腊月廿八', '11-28', '猪', '大寒后', '三', 'Wed', '3', 'Wednesday', '21', '04', '祭祀.沐浴.祈福.斋醮.订盟.纳采.裁衣.拆卸.起基.竖柱.上梁.安床.入殓.除服.成服.移柩.启攒.挂匾.求嗣.出行.合帐.造畜椆栖', '开仓.嫁娶.移徙.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200123', '0', '工作日', '己亥', '腊月廿九', '11-29', '猪', '大寒后', '四', 'Thu', '4', 'Thursday', '22', '04', '祭祀.解除.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200124', '1', '假日', '己亥', '腊月三十', '11-30', '猪', '大寒后', '五', 'Fri', '5', 'Friday', '23', '04', '沐浴.解除.订盟.纳采.裁衣.冠笄.拆卸.修造.动土.移徙.入宅.除服.成服.移柩.破土.启攒.安葬.扫舍.修坟.伐木.纳财.交易.立券', '作灶.祭祀.上梁.出行', null);
INSERT INTO `t_calendar` VALUES ('20200125', '2', '节日', '庚子', '正月初一', '1-1', '鼠', '大寒后', '六', 'Sat', '6', 'Saturday', '24', '04', '出行.嫁娶.订盟.纳采.入殓.安床.启攒.安葬.祭祀.裁衣.会亲友.进人口', '作灶.掘井.谢土.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200126', '2', '节日', '庚子', '正月初二', '1-2', '鼠', '大寒后', '日', 'Sun', '7', 'Sunday', '25', '04', '修饰垣墙.平治道涂.入殓.移柩.余事勿取', '嫁娶.移徙.入宅.开光', null);
INSERT INTO `t_calendar` VALUES ('20200127', '2', '节日', '庚子', '正月初三', '1-3', '鼠', '大寒后', '一', 'Mon', '1', 'Monday', '26', '05', '会亲友.纳采.进人口.修造.动土.竖柱.上梁.祭祀.开光.塑绘.祈福.斋醮.嫁娶.安床.移徙.入宅.安香.纳畜', '出行.治病.安葬.开市', null);
INSERT INTO `t_calendar` VALUES ('20200128', '1', '假日', '庚子', '正月初四', '1-4', '鼠', '大寒后', '二', 'Tue', '2', 'Tuesday', '27', '05', '祭祀.会亲友.出行.订盟.纳采.沐浴.修造.动土.祈福.斋醮.嫁娶.拆卸.安床.入殓.移柩.安葬.谢土.赴任.裁衣.竖柱.上梁.伐木.捕捉.栽种.破土.安门', '造屋.开市.作灶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200129', '1', '假日', '庚子', '正月初五', '1-5', '鼠', '大寒后', '三', 'Wed', '3', 'Wednesday', '28', '05', '解除.破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200130', '1', '假日', '庚子', '正月初六', '1-6', '鼠', '大寒后', '四', 'Thu', '4', 'Thursday', '29', '05', '塑绘.开光.出行.订盟.纳采.除服.成服.嫁娶.纳婿.入殓.移柩.启攒.安葬.立碑', '入宅.安床', null);
INSERT INTO `t_calendar` VALUES ('20200131', '0', '工作日', '庚子', '正月初七', '1-7', '鼠', '大寒后', '五', 'Fri', '5', 'Friday', '30', '05', '入殓.除服.成服.移柩.启攒.安葬.立碑.余事勿取', '破土.伐木', null);
INSERT INTO `t_calendar` VALUES ('20200201', '0', '工作日', '庚子', '正月初八', '1-8', '鼠', '大寒后', '六', 'Sat', '6', 'Saturday', '31', '05', '祭祀.祈福.斋醮.塑绘.开光.除服.成服.入殓.作灶.嫁娶.捕捉.畋猎.纳财', '开仓.造屋.安葬.安床', null);
INSERT INTO `t_calendar` VALUES ('20200202', '1', '假日', '庚子', '正月初九', '1-9', '鼠', '大寒后', '日', 'Sun', '7', 'Sunday', '32', '05', '祭祀.出行.沐浴.裁衣.祈福.斋醮.订盟.纳采.嫁娶.安机械.开市.立券.安碓硙.纳畜', '栽种.嫁娶.入殓.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200203', '0', '工作日', '庚子', '正月初十', '1-10', '鼠', '大寒后', '一', 'Mon', '1', 'Monday', '33', '06', '祭祀.祈福.斋醮.沐浴.安床.安机械.造车器.入殓.移柩.启攒.安葬.立碑.合帐.经络.交易', '作灶.掘井.嫁娶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200204', '0', '工作日', '庚子', '正月十一', '1-11', '鼠', '立春', '二', 'Tue', '2', 'Tuesday', '34', '06', '祭祀.祈福.求嗣.斋醮.入殓.除服.成服.移柩.安葬.启攒', '嫁娶.动土.开光.造屋.破土', null);
INSERT INTO `t_calendar` VALUES ('20200205', '0', '工作日', '庚子', '正月十二', '1-12', '鼠', '立春后', '三', 'Wed', '3', 'Wednesday', '35', '06', '纳采.会亲友.竖柱.上梁.立券.入殓.移柩.安葬.启攒', '祭祀.移徙.入宅.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200206', '0', '工作日', '庚子', '正月十三', '1-13', '鼠', '立春后', '四', 'Thu', '4', 'Thursday', '36', '06', '祭祀.祈福.斋醮.出行.开市.立券.动土.移徙.入宅.破土.安葬', '开光.嫁娶.作灶.掘井.纳畜', null);
INSERT INTO `t_calendar` VALUES ('20200207', '0', '工作日', '庚子', '正月十四', '1-14', '鼠', '立春后', '五', 'Fri', '5', 'Friday', '37', '06', '会亲友.求嗣.理发.冠笄.结网.捕捉.开光.理发', '开市.动土.安葬.破土', null);
INSERT INTO `t_calendar` VALUES ('20200208', '1', '假日', '庚子', '正月十五', '1-15', '鼠', '立春后', '六', 'Sat', '6', 'Saturday', '38', '06', '祭祀.平治道涂.余事勿取', '嫁娶.祈福.掘井.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200209', '1', '假日', '庚子', '正月十六', '1-16', '鼠', '立春后', '日', 'Sun', '7', 'Sunday', '39', '06', '祈福.求嗣.斋醮.纳采.嫁娶.伐木.修造.动土.移徙.入宅.造庙.安机械.开市.入殓.除服.成服.移柩.安葬.破土.谢土', '置产.造屋.合脊.开光.探病.安门.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200210', '0', '工作日', '庚子', '正月十七', '1-17', '鼠', '立春后', '一', 'Mon', '1', 'Monday', '40', '07', '入学.习艺.出行.纳采.订盟.嫁娶.会亲友.进人口.牧养.捕捉.入殓.移柩.安葬.启攒', '开光.开市.入宅.动土.造屋', null);
INSERT INTO `t_calendar` VALUES ('20200211', '0', '工作日', '庚子', '正月十八', '1-18', '鼠', '立春后', '二', 'Tue', '2', 'Tuesday', '41', '07', '祭祀.沐浴.求医.治病.扫舍.破屋.坏垣.解除.余事勿取', '入宅.开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200212', '0', '工作日', '庚子', '正月十九', '1-19', '鼠', '立春后', '三', 'Wed', '3', 'Wednesday', '42', '07', '祭祀.冠笄.嫁娶.拆卸.修造.动土.起基.上梁.造屋.入宅.开市.开池.塞穴.入殓.除服.成服.移柩.安葬.破土', '安床.栽种.治病.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200213', '0', '工作日', '庚子', '正月二十', '1-20', '鼠', '立春后', '四', 'Thu', '4', 'Thursday', '43', '07', '祭祀.结网.入殓.除服.成服.移柩.安葬.破土', '余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20200214', '0', '工作日', '庚子', '正月廿一', '1-21', '鼠', '立春后', '五', 'Fri', '5', 'Friday', '44', '07', '塑绘.开光.祈福.求嗣.订盟.纳采.裁衣.冠笄.拆卸.修造.动土.起基.安门.安床.移徙.造仓.结网.纳畜', '伐木.作灶.安葬.取渔.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200215', '1', '假日', '庚子', '正月廿二', '1-22', '鼠', '立春后', '六', 'Sat', '6', 'Saturday', '45', '07', '祭祀.沐浴.开光.塑绘.祈福.求嗣.订盟.纳采.冠笄.裁衣.嫁娶.动土.除服.成服.移柩.破土.启攒.出行.安碓硙.放水.开市.立券.交易', '安葬.上梁.入宅.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200216', '1', '假日', '庚子', '正月廿三', '1-23', '鼠', '立春后', '日', 'Sun', '7', 'Sunday', '46', '07', '祭祀.祈福.求嗣.酬神.裁衣.安床.立券.交易.入殓.除服.成服.移柩.谢土.启攒', '出行.嫁娶.入宅.动土', null);
INSERT INTO `t_calendar` VALUES ('20200217', '0', '工作日', '庚子', '正月廿四', '1-24', '鼠', '立春后', '一', 'Mon', '1', 'Monday', '47', '08', '裁衣.合帐.入殓.除服.成服.会亲友.纳财', '祭祀.祈福.移徙.嫁娶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200218', '0', '工作日', '庚子', '正月廿五', '1-25', '鼠', '立春后', '二', 'Tue', '2', 'Tuesday', '48', '08', '祭祀.斋醮.裁衣.合帐.冠笄.订盟.纳采.嫁娶.入宅.安香.谢土.入殓.移柩.破土.立碑.安香.会亲友.出行.祈福.求嗣.立碑.上梁.放水', '掘井', null);
INSERT INTO `t_calendar` VALUES ('20200219', '0', '工作日', '庚子', '正月廿六', '1-26', '鼠', '雨水', '三', 'Wed', '3', 'Wednesday', '49', '08', '安床.合帐.入宅.问名.纳采.求嗣.祭祀.开仓', '斋醮.作灶.安床.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200220', '0', '工作日', '庚子', '正月廿七', '1-27', '鼠', '雨水后', '四', 'Thu', '4', 'Thursday', '50', '08', '作灶.平治道涂', '祭祀.祈福.安葬.安门.余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20200221', '0', '工作日', '庚子', '正月廿八', '1-28', '鼠', '雨水后', '五', 'Fri', '5', 'Friday', '51', '08', '塑绘.开光.酬神.斋醮.订盟.纳采.裁衣.合帐.拆卸.动土.上梁.安床.安香.造庙.挂匾.会亲友.进人口.出行.修造.纳财.伐木.放水.出火.纳畜.沐浴.安门', '造屋.栽种.安葬.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200222', '1', '假日', '庚子', '正月廿九', '1-29', '鼠', '雨水后', '六', 'Sat', '6', 'Saturday', '52', '08', '祭祀.祈福.酬神.订盟.纳采.冠笄.裁衣.合帐.嫁娶.安床.移徙.入宅.安香.入殓.移柩.启攒.安葬.解除.取渔.捕捉.伐木.安门.出火', '栽种.动土.开市.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200223', '1', '假日', '庚子', '二月初一', '2-1', '鼠', '雨水后', '日', 'Sun', '7', 'Sunday', '53', '08', '求医.破屋', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200224', '0', '工作日', '庚子', '二月初二', '2-2', '鼠', '雨水后', '一', 'Mon', '1', 'Monday', '54', '09', '祈福.求嗣.斋醮.塑绘.开光.订盟.纳采.嫁娶.动土.入宅.安香.移柩.安葬.谢土.出行.沐浴.修造.竖柱.上梁.纳财.破土.解除.安门.放水', '作灶.安床', null);
INSERT INTO `t_calendar` VALUES ('20200225', '0', '工作日', '庚子', '二月初三', '2-3', '鼠', '雨水后', '二', 'Tue', '2', 'Tuesday', '55', '09', '取渔.入殓.除服.成服.移柩.破土.安葬.立碑', '嫁娶.上梁.入宅.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200226', '0', '工作日', '庚子', '二月初四', '2-4', '鼠', '雨水后', '三', 'Wed', '3', 'Wednesday', '56', '09', '祭祀.求嗣.沐浴.酬神.订盟.纳采.裁衣.合帐.冠笄.安机械.安床.造仓.开池.经络.纳财.开市.立券.交易.结网.取渔.纳畜.捕捉', '安葬.作灶.伐木.作梁', null);
INSERT INTO `t_calendar` VALUES ('20200227', '0', '工作日', '庚子', '二月初五', '2-5', '鼠', '雨水后', '四', 'Thu', '4', 'Thursday', '57', '09', '祭祀.沐浴.祈福.求嗣.斋醮.订盟.纳采.裁衣.冠笄.开市.立券.交易.纳财.沐浴.除服.谢土.出行.移柩', '入殓.安葬.作灶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200228', '0', '工作日', '庚子', '二月初六', '2-6', '鼠', '雨水后', '五', 'Fri', '5', 'Friday', '58', '09', '祭祀.祈福.求嗣.入殓.启攒.安葬.移柩', '开光.掘井.针灸.出行.嫁娶.入宅.移徙.作灶.动土', null);
INSERT INTO `t_calendar` VALUES ('20200229', '1', '假日', '庚子', '二月初七', '2-7', '鼠', '雨水后', '六', 'Sat', '6', 'Saturday', '59', '09', '安床.解除.裁衣.竖柱.上梁.交易.立券.纳财.纳畜.牧养.入殓.移柩.安葬.启攒', '嫁娶.出行.动土.开渠.入宅.祭祀.掘井', null);
INSERT INTO `t_calendar` VALUES ('20200301', '1', '假日', '庚子', '二月初八', '2-8', '鼠', '雨水后', '日', 'Sun', '7', 'Sunday', '60', '09', '嫁娶.安床.开光.出行.祭祀.动土.出火.解除.会亲友.开市.交易.立券.挂匾.入宅.移徙.拆卸.破土.启攒.安葬', '掘井.词讼', null);
INSERT INTO `t_calendar` VALUES ('20200302', '0', '工作日', '庚子', '二月初九', '2-9', '鼠', '雨水后', '一', 'Mon', '1', 'Monday', '61', '10', '嫁娶.开光.求嗣.会亲友.安床.牧养.塑绘.针灸', '入宅.移徙.出火.分居.安香.作灶.开市.交易.立券.安葬.动土.伐木', null);
INSERT INTO `t_calendar` VALUES ('20200303', '0', '工作日', '庚子', '二月初十', '2-10', '鼠', '雨水后', '二', 'Tue', '2', 'Tuesday', '62', '10', '作灶.解除.平治道涂', '栽种.出行.祈福.行丧.纳畜.安葬.安门.伐木.作梁.牧养', null);
INSERT INTO `t_calendar` VALUES ('20200304', '0', '工作日', '庚子', '二月十一', '2-11', '鼠', '雨水后', '三', 'Wed', '3', 'Wednesday', '63', '10', '解除.沐浴', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200305', '0', '工作日', '庚子', '二月十二', '2-12', '鼠', '雨水后', '四', 'Thu', '4', 'Thursday', '64', '10', '嫁娶.造车器.纳采.订盟.祭祀.祈福.安机械.移徙.入宅.开市.立券.破土.安葬', '纳畜.理发.合寿木', null);
INSERT INTO `t_calendar` VALUES ('20200306', '0', '工作日', '庚子', '二月十三', '2-13', '鼠', '惊蛰', '五', 'Fri', '5', 'Friday', '65', '10', '祈福.斋醮.出行.移徙.入宅.修造.动土.破土.安葬', '纳采.开光.安床.嫁娶.开市', null);
INSERT INTO `t_calendar` VALUES ('20200307', '1', '假日', '庚子', '二月十四', '2-14', '鼠', '惊蛰后', '六', 'Sat', '6', 'Saturday', '66', '10', '破屋.坏垣.余事勿取', '嫁娶.移徙.开市.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200308', '1', '假日', '庚子', '二月十五', '2-15', '鼠', '惊蛰后', '日', 'Sun', '7', 'Sunday', '67', '10', '嫁娶.冠笄.祭祀.出行.会亲友.修造.动土.入殓.破土', '塑绘.开光.造桥.除服.成服', null);
INSERT INTO `t_calendar` VALUES ('20200309', '0', '工作日', '庚子', '二月十六', '2-16', '鼠', '惊蛰后', '一', 'Mon', '1', 'Monday', '68', '11', '开光.求嗣.出行.纳采.冠笄.出火.拆卸.起基.修造.动土.上梁.移徙.造船.开市.交易.立券.纳财', '祈福.嫁娶.安葬.破土', null);
INSERT INTO `t_calendar` VALUES ('20200310', '0', '工作日', '庚子', '二月十七', '2-17', '鼠', '惊蛰后', '二', 'Tue', '2', 'Tuesday', '69', '11', '理发.冠笄.嫁娶.进人口.栽种.捕捉.针灸', '纳财.开市.安葬.破土', null);
INSERT INTO `t_calendar` VALUES ('20200311', '0', '工作日', '庚子', '二月十八', '2-18', '鼠', '惊蛰后', '三', 'Wed', '3', 'Wednesday', '70', '11', '开光.祈福.求嗣.出行.解除.伐木.造屋.起基.修造.架马.安门.移徙.入宅.造庙.除服.成服.移柩.谢土.纳畜.牧养', '纳采.动土.开市.交易.安门', null);
INSERT INTO `t_calendar` VALUES ('20200312', '0', '工作日', '庚子', '二月十九', '2-19', '鼠', '惊蛰后', '四', 'Thu', '4', 'Thursday', '71', '11', '裁衣.经络.伐木.开柱眼.拆卸.修造.动土.上梁.合脊.合寿木.入殓.除服.成服.移柩.破土.安葬.启攒.修坟.立碑', '祭祀.嫁娶.出行.上梁.掘井', null);
INSERT INTO `t_calendar` VALUES ('20200313', '0', '工作日', '庚子', '二月二十', '2-20', '鼠', '惊蛰后', '五', 'Fri', '5', 'Friday', '72', '11', '祭祀.会亲友.立券.交易.裁衣.合帐.嫁娶.冠笄.进人口', '栽种.动土.安葬.掘井.修坟.探病', null);
INSERT INTO `t_calendar` VALUES ('20200314', '1', '假日', '庚子', '二月廿一', '2-21', '鼠', '惊蛰后', '六', 'Sat', '6', 'Saturday', '73', '11', '扫舍.塞穴.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200315', '1', '假日', '庚子', '二月廿二', '2-22', '鼠', '惊蛰后', '日', 'Sun', '7', 'Sunday', '74', '11', '塑绘.开光.订盟.纳采.裁衣.合帐.冠笄.安机械.会亲友.纳财.开市.立券.交易.安床.竖柱.上梁.结网.栽种.解除.经络', '作灶.出行.入宅.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200316', '0', '工作日', '庚子', '二月廿三', '2-23', '鼠', '惊蛰后', '一', 'Mon', '1', 'Monday', '75', '12', '祭祀.嫁娶.纳婿.除服.成服.入殓.移柩', '动土.作灶.入宅.开光.安床', null);
INSERT INTO `t_calendar` VALUES ('20200317', '0', '工作日', '庚子', '二月廿四', '2-24', '鼠', '惊蛰后', '二', 'Tue', '2', 'Tuesday', '76', '12', '祈福.求嗣.开光.塑绘.斋醮.订盟.纳采.嫁娶.拆卸.安床.入宅.安香.移柩.修坟.安葬.谢土.栽种.解除.冠笄.裁衣.移徙.修造.动土.竖柱.放水.启攒.立碑', '赴任', null);
INSERT INTO `t_calendar` VALUES ('20200318', '0', '工作日', '庚子', '二月廿五', '2-25', '鼠', '惊蛰后', '三', 'Wed', '3', 'Wednesday', '77', '12', '祭祀.解除.入殓.除服.成服.移柩.启攒.安葬.修坟.立碑.谢土.沐浴.扫舍.捕捉.取渔.结网.畋猎.理发', '安床.嫁娶.作灶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200319', '0', '工作日', '庚子', '二月廿六', '2-26', '鼠', '惊蛰后', '四', 'Thu', '4', 'Thursday', '78', '12', '破屋.坏垣', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200320', '0', '工作日', '庚子', '二月廿七', '2-27', '鼠', '惊蛰后', '五', 'Fri', '5', 'Friday', '79', '12', '祭祀.出行.订盟.纳采.裁衣.合帐.冠笄.进人口.动土.安床.作灶.入殓.移柩.安葬.破土.结网.取渔.畋猎', '作梁.造庙', null);
INSERT INTO `t_calendar` VALUES ('20200321', '1', '假日', '庚子', '二月廿八', '2-28', '鼠', '春分', '六', 'Sat', '6', 'Saturday', '80', '12', '祭祀.开光.塑绘.订盟.纳采.合帐.冠笄.拆卸.动土.起基.上梁.入宅.安香.开市.立券.纳财.沐浴.求嗣.出火.竖柱.安门', '造庙.嫁娶.伐木.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200322', '1', '假日', '庚子', '二月廿九', '2-29', '鼠', '春分后', '日', 'Sun', '7', 'Sunday', '81', '12', '祭祀.沐浴.捕捉.栽种', '嫁娶.入宅.移徙.作灶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200323', '0', '工作日', '庚子', '二月三十', '2-30', '鼠', '春分后', '一', 'Mon', '1', 'Monday', '82', '13', '祭祀.开光.塑绘.酬神.斋醮.订盟.纳采.嫁娶.裁衣.动土.起基.出火.拆卸.移徙.入宅.安香.修造.竖柱.上梁.纳畜.牧养.祈福.求嗣.解除.伐木.定磉.造屋.安门', '栽种.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200324', '0', '工作日', '庚子', '三月初一', '3-1', '鼠', '春分后', '二', 'Tue', '2', 'Tuesday', '83', '13', '订盟.纳采.冠笄.拆卸.修造.动土.安床.入殓.除服.成服.移柩.安葬.破土.启攒.造仓', '作灶.开光.嫁娶.开市.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200325', '0', '工作日', '庚子', '三月初二', '3-2', '鼠', '春分后', '三', 'Wed', '3', 'Wednesday', '84', '13', '祈福.开光.塑绘.酬神.订盟.纳采.裁衣.安床.开市.立券.入殓.除服.成服.移柩.启攒.安葬.立碑.赴任.会亲友.出行.交易.竖柱', '作灶.掘井.动土.栽种', null);
INSERT INTO `t_calendar` VALUES ('20200326', '0', '工作日', '庚子', '三月初三', '3-3', '鼠', '春分后', '四', 'Thu', '4', 'Thursday', '85', '13', '祭祀.扫舍.塞穴', '栽种.作灶.安葬.嫁娶', null);
INSERT INTO `t_calendar` VALUES ('20200327', '0', '工作日', '庚子', '三月初四', '3-4', '鼠', '春分后', '五', 'Fri', '5', 'Friday', '86', '13', '开光.塑绘.裁衣.冠笄.伐木.拆卸.竖柱.上梁.开仓.会亲友.安机械.造仓.造屋.交易.解除.开市.立券.纳财', '出行.嫁娶.入宅.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200328', '1', '假日', '庚子', '三月初五', '3-5', '鼠', '春分后', '六', 'Sat', '6', 'Saturday', '87', '13', '冠笄.入殓.除服.成服.移柩.平治道涂.修饰垣墙', '造屋.作灶.治病.探病', null);
INSERT INTO `t_calendar` VALUES ('20200329', '1', '假日', '庚子', '三月初六', '3-6', '鼠', '春分后', '日', 'Sun', '7', 'Sunday', '88', '13', '祭祀.嫁娶.祈福.纳采.裁衣.合帐.安床.入宅.安香.入殓.移柩.安葬.谢土.修造.安碓硙.求嗣.会亲友.挂匾.交易.立券.纳财.造仓.放水', '栽种.伐木', null);
INSERT INTO `t_calendar` VALUES ('20200330', '0', '工作日', '庚子', '三月初七', '3-7', '鼠', '春分后', '一', 'Mon', '1', 'Monday', '89', '14', '祭祀.祈福.斋醮.订盟.纳采.裁衣.合帐.拆卸.修造.动土.上梁.起基.移柩.安葬.谢土.沐浴.扫舍.开柱眼.伐木.出火', '安床.开市.立券.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200331', '0', '工作日', '庚子', '三月初八', '3-8', '鼠', '春分后', '二', 'Tue', '2', 'Tuesday', '90', '14', '破屋.坏垣.求医.治病', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200401', '0', '工作日', '庚子', '三月初九', '3-9', '鼠', '春分后', '三', 'Wed', '3', 'Wednesday', '91', '14', '祭祀.动土.上梁.订盟.纳采.嫁娶.安机械.拆卸.安床.入宅.安香.入殓.移柩.破土.安葬.立碑.谢土.赴任.出行.移徙.祈福.求嗣.解除.造仓.进人口', '开光.出货财', null);
INSERT INTO `t_calendar` VALUES ('20200402', '0', '工作日', '庚子', '三月初十', '3-10', '鼠', '春分后', '四', 'Thu', '4', 'Thursday', '92', '14', '祭祀.开光.塑绘.纳采.裁衣.拆卸.安床.起基.动土.竖柱.上梁.移徙.入宅.安香.开市.立券.挂匾.沐浴.出行.求嗣.安门', '嫁娶.栽种.伐木.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200403', '0', '工作日', '庚子', '三月十一', '3-11', '鼠', '春分后', '五', 'Fri', '5', 'Friday', '93', '14', '裁衣.合帐.冠笄.嫁娶.纳婿.安床.入殓.纳财', '作灶.开市.安葬.作梁', null);
INSERT INTO `t_calendar` VALUES ('20200404', '2', '节日', '庚子', '三月十二', '3-12', '鼠', '春分后', '六', 'Sat', '6', 'Saturday', '94', '14', '祭祀.捕捉.解除.余事勿取', '嫁娶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200405', '1', '假日', '庚子', '三月十三', '3-13', '鼠', '清明', '日', 'Sun', '7', 'Sunday', '95', '14', '纳采.嫁娶.出行.开市.立券.纳畜.牧养.出火.移徙.入宅', '祈福.动土.破土.安葬.入殓', null);
INSERT INTO `t_calendar` VALUES ('20200406', '1', '假日', '庚子', '三月十四', '3-14', '鼠', '清明后', '一', 'Mon', '1', 'Monday', '96', '15', '祭祀.祈福.求嗣.斋醮.冠笄.作灶.纳财.交易', '开光.嫁娶.掘井.安葬.安门.探病', null);
INSERT INTO `t_calendar` VALUES ('20200407', '0', '工作日', '庚子', '三月十五', '3-15', '鼠', '清明后', '二', 'Tue', '2', 'Tuesday', '97', '15', '祭祀.解除.教牛马.出行.余事勿取', '动土.破土.行丧.开光.作梁.安葬.探病', null);
INSERT INTO `t_calendar` VALUES ('20200408', '0', '工作日', '庚子', '三月十六', '3-16', '鼠', '清明后', '三', 'Wed', '3', 'Wednesday', '98', '15', '沐浴.斋醮.解除.求医.治病.会亲友.造畜椆栖.栽种.理发.扫舍', '开市.嫁娶.移徙.入宅.掘井.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200409', '0', '工作日', '庚子', '三月十七', '3-17', '鼠', '清明后', '四', 'Thu', '4', 'Thursday', '99', '15', '求嗣.出行.解除.订盟.纳采.嫁娶.会亲友.进人口.安床.开市.交易.纳畜.牧养.入殓.除服.成服.移柩.安葬.启攒', '祈福.开市.修造.动土.破土.谢土', null);
INSERT INTO `t_calendar` VALUES ('20200410', '0', '工作日', '庚子', '三月十八', '3-18', '鼠', '清明后', '五', 'Fri', '5', 'Friday', '100', '15', '祭祀.作灶.平治道涂.余事勿取', '嫁娶.安葬.动土.安床.治病', null);
INSERT INTO `t_calendar` VALUES ('20200411', '1', '假日', '庚子', '三月十九', '3-19', '鼠', '清明后', '六', 'Sat', '6', 'Saturday', '101', '15', '造车器.祭祀.祈福.求嗣.斋醮.开市.交易.安机械.雕刻.开光.造屋.合脊.起基.定磉.安门.纳畜.安葬.开生坟.立碑.谢土.斋醮', '入宅.动土.开仓.出货财', null);
INSERT INTO `t_calendar` VALUES ('20200412', '1', '假日', '庚子', '三月二十', '3-20', '鼠', '清明后', '日', 'Sun', '7', 'Sunday', '102', '15', '祭祀.祈福.开光.求嗣.斋醮.纳采.订盟.求医.治病.起基.定磉.造船.取渔.解除.安葬.启攒.谢土.入殓', '开市.动土.掘井.开池', null);
INSERT INTO `t_calendar` VALUES ('20200413', '0', '工作日', '庚子', '三月廿一', '3-21', '鼠', '清明后', '一', 'Mon', '1', 'Monday', '103', '16', '祭祀.沐浴.破屋.坏垣.求医.治病.解除.余事勿取', '嫁娶.开市.交易.入宅.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200414', '0', '工作日', '庚子', '三月廿二', '3-22', '鼠', '清明后', '二', 'Tue', '2', 'Tuesday', '104', '16', '诸事不宜', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200415', '0', '工作日', '庚子', '三月廿三', '3-23', '鼠', '清明后', '三', 'Wed', '3', 'Wednesday', '105', '16', '祭祀.塑绘.开光.订盟.纳采.冠笄.裁衣.安机械.拆卸.修造.动土.安床.经络.开市', '出火.入宅.安葬.伐木', null);
INSERT INTO `t_calendar` VALUES ('20200416', '0', '工作日', '庚子', '三月廿四', '3-24', '鼠', '清明后', '四', 'Thu', '4', 'Thursday', '106', '16', '祭祀.余事勿取', '造庙.嫁娶.安床.余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20200417', '0', '工作日', '庚子', '三月廿五', '3-25', '鼠', '清明后', '五', 'Fri', '5', 'Friday', '107', '16', '订盟.纳采.嫁娶.进人口.会亲友.交易.立券.动土.除服.谢土.移柩.破土.启攒.赴任.出行.开市.纳财.栽种', '入殓.安葬.入宅.安床', null);
INSERT INTO `t_calendar` VALUES ('20200418', '1', '假日', '庚子', '三月廿六', '3-26', '鼠', '清明后', '六', 'Sat', '6', 'Saturday', '108', '16', '祭祀.祈福.裁衣.合帐.安床.入殓.除服.成服.移柩.破土.启攒.安葬.谢土.立碑.造畜椆栖', '掘井.安门.嫁娶.纳采', null);
INSERT INTO `t_calendar` VALUES ('20200419', '1', '假日', '庚子', '三月廿七', '3-27', '鼠', '清明后', '日', 'Sun', '7', 'Sunday', '109', '16', '祭祀.进人口.嫁娶.安床.解除.冠笄.出行.裁衣.扫舍', '掘井.动土.破土.安葬.开光', null);
INSERT INTO `t_calendar` VALUES ('20200420', '0', '工作日', '庚子', '三月廿八', '3-28', '鼠', '谷雨', '一', 'Mon', '1', 'Monday', '110', '17', '纳采.开光.求医.治病.动土.上梁.移徙.入宅', '嫁娶.开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200421', '0', '工作日', '庚子', '三月廿九', '3-29', '鼠', '谷雨后', '二', 'Tue', '2', 'Tuesday', '111', '17', '祭祀.会亲友.开市.安床.启攒.安葬', '嫁娶.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200422', '0', '工作日', '庚子', '三月三十', '3-30', '鼠', '谷雨后', '三', 'Wed', '3', 'Wednesday', '112', '17', '祭祀.作灶.掘井.平治道涂', '嫁娶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200423', '0', '工作日', '庚子', '四月初一', '4-1', '鼠', '谷雨后', '四', 'Thu', '4', 'Thursday', '113', '17', '祭祀.斋醮.开市.动土.入殓.破土.安葬', '嫁娶.移徙.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200424', '0', '工作日', '庚子', '四月初二', '4-2', '鼠', '谷雨后', '五', 'Fri', '5', 'Friday', '114', '17', '嫁娶.纳采.祭祀.祈福.出行.移徙.求医', '开市.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200425', '1', '假日', '庚子', '四月初三', '4-3', '鼠', '谷雨后', '六', 'Sat', '6', 'Saturday', '115', '17', '祭祀.求医.治病.解除.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200426', '0', '工作日', '庚子', '四月初四', '4-4', '鼠', '谷雨后', '日', 'Sun', '7', 'Sunday', '116', '17', '沐浴.结网.取渔', '嫁娶.入宅.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200427', '0', '工作日', '庚子', '四月初五', '4-5', '鼠', '谷雨后', '一', 'Mon', '1', 'Monday', '117', '18', null, '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200428', '0', '工作日', '庚子', '四月初六', '4-6', '鼠', '谷雨后', '二', 'Tue', '2', 'Tuesday', '118', '18', '解除.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200429', '0', '工作日', '庚子', '四月初七', '4-7', '鼠', '谷雨后', '三', 'Wed', '3', 'Wednesday', '119', '18', '嫁娶.开光.出行.出火.拆卸.进人口.开市.立券.交易.挂匾.入宅.移徙.安床.栽种', '祈福.入殓.祭祀.作灶.安葬.探病', null);
INSERT INTO `t_calendar` VALUES ('20200430', '0', '工作日', '庚子', '四月初八', '4-8', '鼠', '谷雨后', '四', 'Thu', '4', 'Thursday', '120', '18', '嫁娶.出行.合帐.冠笄.安床.除服.成服.作灶.交易.立券.入殓.移柩.破土.安葬', '词讼.开光.开市', null);
INSERT INTO `t_calendar` VALUES ('20200501', '2', '节日', '庚子', '四月初九', '4-9', '鼠', '谷雨后', '五', 'Fri', '5', 'Friday', '121', '18', '出行.修饰垣墙.造畜椆栖.教牛马.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200502', '1', '假日', '庚子', '四月初十', '4-10', '鼠', '谷雨后', '六', 'Sat', '6', 'Saturday', '122', '18', '祭祀.祈福.开光.求嗣.解除.伐木.出火.入宅.移徙.安床.拆卸.修造.动土.造畜椆栖', '嫁娶.纳财.安葬.出行.开市.立券.作灶.栽种', null);
INSERT INTO `t_calendar` VALUES ('20200503', '1', '假日', '庚子', '四月十一', '4-11', '鼠', '谷雨后', '日', 'Sun', '7', 'Sunday', '123', '18', '纳采.嫁娶.开光.出行.理发.会亲友.开市.安床.栽种.牧养.入殓.移柩.启攒', '谢土.祈福.上梁.作灶.斋醮.修造.入宅.安门', null);
INSERT INTO `t_calendar` VALUES ('20200504', '1', '假日', '庚子', '四月十二', '4-12', '鼠', '谷雨后', '一', 'Mon', '1', 'Monday', '124', '19', '祭祀.平治道涂.解除.修饰垣墙.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200505', '1', '假日', '庚子', '四月十三', '4-13', '鼠', '谷雨后', '二', 'Tue', '2', 'Tuesday', '125', '19', '祭祀.沐浴.移徙.破土.安葬.扫舍.平治道涂', '祈福.嫁娶.入宅.安床.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200506', '0', '工作日', '庚子', '四月十四', '4-14', '鼠', '立夏', '三', 'Wed', '3', 'Wednesday', '126', '19', '祭祀.祈福.斋醮.求嗣.安机械.纳畜.移徙.入宅.安机械.塑绘.开光.起基.竖柱.上梁.作灶.安门.安香.出火.造屋.启攒.安葬', '动土.破土.嫁娶.嫁娶', null);
INSERT INTO `t_calendar` VALUES ('20200507', '0', '工作日', '庚子', '四月十五', '4-15', '鼠', '立夏后', '四', 'Thu', '4', 'Thursday', '127', '19', '嫁娶.纳采.订盟.斋醮.开光.祭祀.祈福.求医.治病.会亲友.动土.解除.捕捉.纳畜.牧养.入殓.破土.安葬', '移徙.入宅.造屋.架马', null);
INSERT INTO `t_calendar` VALUES ('20200508', '0', '工作日', '庚子', '四月十六', '4-16', '鼠', '立夏后', '五', 'Fri', '5', 'Friday', '128', '19', '祭祀.沐浴.解除.破屋.坏垣.余事勿取', '行丧.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200509', '0', '工作日', '庚子', '四月十七', '4-17', '鼠', '立夏后', '六', 'Sat', '6', 'Saturday', '129', '19', '沐浴.扫舍.余事勿取', '斋醮.开市.嫁娶.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200510', '1', '假日', '庚子', '四月十八', '4-18', '鼠', '立夏后', '日', 'Sun', '7', 'Sunday', '130', '19', '开市.交易.立券.安机械.会亲友.开光.求医.治病.造屋.起基.修造.动土.定磉.竖柱.上梁.安门.作灶.放水.作厕.开池.栽种.牧养.造畜椆栖.破土.安葬.立碑', '嫁娶.出火.移徙.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200511', '0', '工作日', '庚子', '四月十九', '4-19', '鼠', '立夏后', '一', 'Mon', '1', 'Monday', '131', '20', '栽种.捕捉.畋猎.余事勿取', '开市.动土.祭祀.斋醮.安葬.探病', null);
INSERT INTO `t_calendar` VALUES ('20200512', '0', '工作日', '庚子', '四月二十', '4-20', '鼠', '立夏后', '二', 'Tue', '2', 'Tuesday', '132', '20', '嫁娶.祭祀.祈福.求嗣.斋醮.订盟.纳采.解除.出行.动土.破土.习艺.针灸.理发.会亲友.起基.修造.动土.竖柱.定磉.安床.拆卸.纳畜.牧养.放水.破土.除服.成服.修坟.立碑', '开市.入宅.探病.出火.造屋', null);
INSERT INTO `t_calendar` VALUES ('20200513', '0', '工作日', '庚子', '四月廿一', '4-21', '鼠', '立夏后', '三', 'Wed', '3', 'Wednesday', '133', '20', '余事勿取', '余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20200514', '0', '工作日', '庚子', '四月廿二', '4-22', '鼠', '立夏后', '四', 'Thu', '4', 'Thursday', '134', '20', '塞穴.断蚁.结网.余事勿取', '破土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200515', '0', '工作日', '庚子', '四月廿三', '4-23', '鼠', '立夏后', '五', 'Fri', '5', 'Friday', '135', '20', '开光.出行.纳采.嫁娶.伐木.架马.出火.拆卸.移徙.入宅.造庙.造桥.造船.造畜椆栖.开市.入殓.除服.成服.移柩.安葬', null, null);
INSERT INTO `t_calendar` VALUES ('20200516', '1', '假日', '庚子', '四月廿四', '4-24', '鼠', '立夏后', '六', 'Sat', '6', 'Saturday', '136', '20', '进人口.牧养.置产.塞穴.结网.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200517', '1', '假日', '庚子', '四月廿五', '4-25', '鼠', '立夏后', '日', 'Sun', '7', 'Sunday', '137', '20', '开光.出行.嫁娶', '会亲友.进人口.修造.动土.起基.移徙.开市.纳畜.入殓.除服.成服.移柩.破土.安葬.修坟.立碑.会亲友', null);
INSERT INTO `t_calendar` VALUES ('20200518', '0', '工作日', '庚子', '四月廿六', '4-26', '鼠', '立夏后', '一', 'Mon', '1', 'Monday', '138', '21', '嫁娶.纳采.出行.祭祀.祈福.开市.动土.移徙.入宅.破土.安葬', '安门', null);
INSERT INTO `t_calendar` VALUES ('20200519', '0', '工作日', '庚子', '四月廿七', '4-27', '鼠', '立夏后', '二', 'Tue', '2', 'Tuesday', '139', '21', '嫁娶.纳采.求医.治病.修造.动土.移徙.入宅.破土.安葬', '开市.开光', null);
INSERT INTO `t_calendar` VALUES ('20200520', '0', '工作日', '庚子', '四月廿八', '4-28', '鼠', '立夏后', '三', 'Wed', '3', 'Wednesday', '140', '21', '祭祀.破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200521', '0', '工作日', '庚子', '四月廿九', '4-29', '鼠', '小满', '四', 'Thu', '4', 'Thursday', '141', '21', '嫁娶.纳采.祭祀.祈福.出行.动土.上梁.移徙.入宅.破土.安葬', '祈福.斋醮', null);
INSERT INTO `t_calendar` VALUES ('20200522', '0', '工作日', '庚子', '四月三十', '4-30', '鼠', '小满后', '五', 'Fri', '5', 'Friday', '142', '21', '纳采.祭祀.祈福.开市.求医.治病.动土.纳畜', '嫁娶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200523', '1', '假日', '庚子', '闰四月初一', '5-1', '鼠', '小满后', '六', 'Sat', '6', 'Saturday', '143', '21', '嫁娶.纳采.出行.移徙.入宅', '动土.破土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200524', '1', '假日', '庚子', '闰四月初二', '5-2', '鼠', '小满后', '日', 'Sun', '7', 'Sunday', '144', '21', '订盟.纳采.祭祀.动土.破土.交易.立券', '嫁娶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200525', '0', '工作日', '庚子', '闰四月初三', '5-3', '鼠', '小满后', '一', 'Mon', '1', 'Monday', '145', '22', '嫁娶.裁衣.祭祀.出行.安床.作灶.移徙.入宅.破土.安葬', '赴任.捕捉', null);
INSERT INTO `t_calendar` VALUES ('20200526', '0', '工作日', '庚子', '闰四月初四', '5-4', '鼠', '小满后', '二', 'Tue', '2', 'Tuesday', '146', '22', '塞穴.结网.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200527', '0', '工作日', '庚子', '闰四月初五', '5-5', '鼠', '小满后', '三', 'Wed', '3', 'Wednesday', '147', '22', '嫁娶.订盟.纳采.出行.祭祀.祈福.斋醮.动土.上梁.破土.安葬', '移徙.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200528', '0', '工作日', '庚子', '闰四月初六', '5-6', '鼠', '小满后', '四', 'Thu', '4', 'Thursday', '148', '22', '订盟.纳采.会亲友.安床.作灶.造畜椆栖', '开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200529', '0', '工作日', '庚子', '闰四月初七', '5-7', '鼠', '小满后', '五', 'Fri', '5', 'Friday', '149', '22', '沐浴.平治道涂.扫舍.入殓.移柩.破土.启攒.安葬.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200530', '1', '假日', '庚子', '闰四月初八', '5-8', '鼠', '小满后', '六', 'Sat', '6', 'Saturday', '150', '22', '嫁娶.祭祀.祈福.求嗣.开光.出行.出火.拆卸.动土.上梁.进人口.入宅.移徙.安床.安门.开市.交易.立券.挂匾.栽种.破土.安葬', null, null);
INSERT INTO `t_calendar` VALUES ('20200531', '1', '假日', '庚子', '闰四月初九', '5-9', '鼠', '小满后', '日', 'Sun', '7', 'Sunday', '151', '22', '祭祀.开光.出行.解除.塑绘.裁衣.入殓.移柩.破土.启攒.安葬.除服.成服', '嫁娶.上梁.修造.拆卸.架马.入宅.伐木.动土.出火.开柱眼', null);
INSERT INTO `t_calendar` VALUES ('20200601', '0', '工作日', '庚子', '闰四月初十', '5-10', '鼠', '小满后', '一', 'Mon', '1', 'Monday', '152', '23', '祭祀.解除.破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200602', '0', '工作日', '庚子', '闰四月十一', '5-11', '鼠', '小满后', '二', 'Tue', '2', 'Tuesday', '153', '23', '嫁娶.祭祀.祈福.求嗣.开光.出行.拆卸.动土.上梁.出火.进人口.入宅.移徙.安床.栽种.纳畜.牧养.竖柱.安门.修造.解除.会亲友', null, null);
INSERT INTO `t_calendar` VALUES ('20200603', '0', '工作日', '庚子', '闰四月十二', '5-12', '鼠', '小满后', '三', 'Wed', '3', 'Wednesday', '154', '23', '开市.交易.立券.祭祀.祈福.开光.伐木.进人口.安床.拆卸.修造.动土.栽种.破土.移柩.安葬', '入宅.移徙.理发.出火.嫁娶.出行', null);
INSERT INTO `t_calendar` VALUES ('20200604', '0', '工作日', '庚子', '闰四月十三', '5-13', '鼠', '小满后', '四', 'Thu', '4', 'Thursday', '155', '23', '结网.解除.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200605', '0', '工作日', '庚子', '闰四月十四', '5-14', '鼠', '小满后', '五', 'Fri', '5', 'Friday', '156', '23', '祭祀.作灶.余事勿取', '开市.安葬.破土.修坟.掘井', null);
INSERT INTO `t_calendar` VALUES ('20200606', '1', '假日', '庚子', '闰四月十五', '5-15', '鼠', '芒种', '六', 'Sat', '6', 'Saturday', '157', '23', '祭祀.祈福.求嗣.斋醮.安香.解除.移徙.入宅.会亲友.求医.治病.动土.破土.开生坟.合寿木', '合帐.上梁.经络.安葬.入殓', null);
INSERT INTO `t_calendar` VALUES ('20200607', '1', '假日', '庚子', '闰四月十六', '5-16', '鼠', '芒种后', '日', 'Sun', '7', 'Sunday', '158', '23', '嫁娶.冠笄.修造.动土.作灶.移徙.入宅.补垣.塞穴.纳畜.牧养.架马.修造.动土.起基.定磉.开池.造船', '祈福.开光.掘井.开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200608', '0', '工作日', '庚子', '闰四月十七', '5-17', '鼠', '芒种后', '一', 'Mon', '1', 'Monday', '159', '24', '祭祀.交易.纳财', '斋醮.开渠.上梁.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200609', '0', '工作日', '庚子', '闰四月十八', '5-18', '鼠', '芒种后', '二', 'Tue', '2', 'Tuesday', '160', '24', '嫁娶.订盟.纳采.冠笄.会亲友.安机械.造车器.祭祀.出行.纳财.入宅.安香.出火.入学.塑绘.开光.拆卸.起基.修造.动土.牧养.栽种.安门.作厕', '行丧.伐木.作梁.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200610', '0', '工作日', '庚子', '闰四月十九', '5-19', '鼠', '芒种后', '三', 'Wed', '3', 'Wednesday', '161', '24', '开光.求嗣.出行.冠笄.嫁娶.伐木.架马.开柱眼.修造.移徙.入宅.开市.交易.立券.出行.安香.出火.挂匾.起基.修造.开生坟.合寿木.入殓.除服.成服.移柩.安葬', '安床.出货财.作灶.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200611', '0', '工作日', '庚子', '闰四月二十', '5-20', '鼠', '芒种后', '四', 'Thu', '4', 'Thursday', '162', '24', '祭祀.沐浴.理发.嫁娶.作灶.整手足甲.扫舍.修饰垣墙.平治道涂', '斋醮.出行.治病.合寿木', null);
INSERT INTO `t_calendar` VALUES ('20200612', '0', '工作日', '庚子', '闰四月廿一', '5-21', '鼠', '芒种后', '五', 'Fri', '5', 'Friday', '163', '24', '安机械.移徙.入宅.出行.祭祀.祈福.斋醮.纳采.订盟.安香.出火.解除.会亲友.修造.动土.拆卸.起基.定磉.移徙.入宅.造屋.安床.修造.破土.安葬.入殓.立碑', '开市.伐木.作梁.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200613', '1', '假日', '庚子', '闰四月廿二', '5-22', '鼠', '芒种后', '六', 'Sat', '6', 'Saturday', '164', '24', '祭祀.沐浴.捕捉.结网.畋猎.取渔.余事勿取', '开市.交易.嫁娶.安葬.行丧', null);
INSERT INTO `t_calendar` VALUES ('20200614', '1', '假日', '庚子', '闰四月廿三', '5-23', '鼠', '芒种后', '日', 'Sun', '7', 'Sunday', '165', '24', '破屋.坏垣.求医.治病.畋猎.余事勿取', '嫁娶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200615', '0', '工作日', '庚子', '闰四月廿四', '5-24', '鼠', '芒种后', '一', 'Mon', '1', 'Monday', '166', '25', '嫁娶.出行.安机械.祭祀.塑绘.开光.治病.经络.安床.结网.塞穴.破土.入殓', '开市.安门.掘井.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200616', '0', '工作日', '庚子', '闰四月廿五', '5-25', '鼠', '芒种后', '二', 'Tue', '2', 'Tuesday', '167', '25', '订盟.纳采.会亲友.进人口.雕刻.拆卸.修造.动土.起基.开市.栽种.纳畜.牧养.入殓.除服.成服.移柩.破土.安葬', null, null);
INSERT INTO `t_calendar` VALUES ('20200617', '0', '工作日', '庚子', '闰四月廿六', '5-26', '鼠', '芒种后', '三', 'Wed', '3', 'Wednesday', '168', '25', '祭祀.捕捉.取渔.修饰垣墙.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200618', '0', '工作日', '庚子', '闰四月廿七', '5-27', '鼠', '芒种后', '四', 'Thu', '4', 'Thursday', '169', '25', '嫁娶.纳采.祭祀.祈福.求医.治病.出行.动土.移徙.入宅', '开市.安门', null);
INSERT INTO `t_calendar` VALUES ('20200619', '0', '工作日', '庚子', '闰四月廿八', '5-28', '鼠', '芒种后', '五', 'Fri', '5', 'Friday', '170', '25', '裁衣.作灶.移徙.入宅.纳畜', '嫁娶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200620', '1', '假日', '庚子', '闰四月廿九', '5-29', '鼠', '芒种后', '六', 'Sat', '6', 'Saturday', '171', '25', '祭祀.入殓.移柩.启攒.安葬', '上梁.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200621', '1', '假日', '庚子', '五月初一', '6-1', '鼠', '芒种后', '日', 'Sun', '7', 'Sunday', '172', '25', '订盟.纳采.出行.祈福.斋醮.安床.会亲友', '移徙.入宅.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200622', '0', '工作日', '庚子', '五月初二', '6-2', '鼠', '夏至', '一', 'Mon', '1', 'Monday', '173', '26', '嫁娶.纳采.出行.求医.治病.开市.移徙.入宅.启攒.安葬', '动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200623', '0', '工作日', '庚子', '五月初三', '6-3', '鼠', '夏至后', '二', 'Tue', '2', 'Tuesday', '174', '26', '嫁娶.祭祀.沐浴.扫舍.修饰垣墙', '行丧.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200624', '0', '工作日', '庚子', '五月初四', '6-4', '鼠', '夏至后', '三', 'Wed', '3', 'Wednesday', '175', '26', '嫁娶.订盟.纳采.出行.开市.祭祀.祈福.动土.移徙.入宅.破土.安葬', '作灶', null);
INSERT INTO `t_calendar` VALUES ('20200625', '2', '节日', '庚子', '五月初五', '6-5', '鼠', '夏至后', '四', 'Thu', '4', 'Thursday', '176', '26', '订盟.纳采.出行.祭祀.祈福.修造.动土.移徙.入宅', '开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200626', '1', '假日', '庚子', '五月初六', '6-6', '鼠', '夏至后', '五', 'Fri', '5', 'Friday', '177', '26', '诸事不宜', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200627', '1', '假日', '庚子', '五月初七', '6-7', '鼠', '夏至后', '六', 'Sat', '6', 'Saturday', '178', '26', '嫁娶.订盟.纳采.祭祀.祈福.入殓.破土.安葬', '开光.开市', null);
INSERT INTO `t_calendar` VALUES ('20200628', '0', '工作日', '庚子', '五月初八', '6-8', '鼠', '夏至后', '日', 'Sun', '7', 'Sunday', '179', '26', '开光.求医.治病.动土.上梁.入殓.破土.安葬', '嫁娶.开光', null);
INSERT INTO `t_calendar` VALUES ('20200629', '0', '工作日', '庚子', '五月初九', '6-9', '鼠', '夏至后', '一', 'Mon', '1', 'Monday', '180', '27', '祭祀.栽种.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200630', '0', '工作日', '庚子', '五月初十', '6-10', '鼠', '夏至后', '二', 'Tue', '2', 'Tuesday', '181', '27', '嫁娶.开光.祭祀.祈福.求嗣.出行.解除.伐木.入宅.移徙.安床.出火.拆卸.修造.上梁.栽种.移柩', '安葬.开市.交易.立券', null);
INSERT INTO `t_calendar` VALUES ('20200701', '0', '工作日', '庚子', '五月十一', '6-11', '鼠', '夏至后', '三', 'Wed', '3', 'Wednesday', '182', '27', '求嗣.嫁娶.纳采.合帐.裁衣.冠笄.伐木.作梁.修造.动土.起基.竖柱.上梁.安门.作灶.筑堤.造畜椆栖', '安葬.出行.祈福.栽种', null);
INSERT INTO `t_calendar` VALUES ('20200702', '0', '工作日', '庚子', '五月十二', '6-12', '鼠', '夏至后', '四', 'Thu', '4', 'Thursday', '183', '27', '祭祀.解除.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200703', '0', '工作日', '庚子', '五月十三', '6-13', '鼠', '夏至后', '五', 'Fri', '5', 'Friday', '184', '27', '嫁娶.祭祀.祈福.出火.开光.求嗣.出行.拆卸.开市.交易.立券.挂匾.入宅.移徙.安床.栽种.动土', '安葬.行丧.伐木.作梁', null);
INSERT INTO `t_calendar` VALUES ('20200704', '1', '假日', '庚子', '五月十四', '6-14', '鼠', '夏至后', '六', 'Sat', '6', 'Saturday', '185', '27', '开光.求嗣.出行.解除.伐木.出火.拆卸.修造.上梁.起基.入宅.移徙.开市.交易.立券.栽种.牧养.入殓.安葬.除服.成服', '置产.安床', null);
INSERT INTO `t_calendar` VALUES ('20200705', '1', '假日', '庚子', '五月十五', '6-15', '鼠', '夏至后', '日', 'Sun', '7', 'Sunday', '186', '27', '祭祀.理发.修饰垣墙.平治道涂.沐浴.整手足甲.扫舍', '出行.安门.修造.嫁娶.上梁.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200706', '0', '工作日', '庚子', '五月十六', '6-16', '鼠', '夏至后', '一', 'Mon', '1', 'Monday', '187', '28', '祭祀.修饰垣墙.平治道涂', '开市.动土.破土.嫁娶.修造.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200707', '0', '工作日', '庚子', '五月十七', '6-17', '鼠', '小暑', '二', 'Tue', '2', 'Tuesday', '188', '28', '订盟.纳采.祭祀.祈福.开光.安香.出火.立券.安机械.移徙.入宅.竖柱.上梁.会亲友.安床.拆卸.挂匾.牧养.教牛马', '嫁娶.安葬.行丧.破土.修坟', null);
INSERT INTO `t_calendar` VALUES ('20200708', '0', '工作日', '庚子', '五月十八', '6-18', '鼠', '小暑后', '三', 'Wed', '3', 'Wednesday', '189', '28', '沐浴.理发.捕捉.入殓.移柩.破土.启攒.安葬', '出火.嫁娶.入宅.作灶.破土.上梁.动土', null);
INSERT INTO `t_calendar` VALUES ('20200709', '0', '工作日', '庚子', '五月十九', '6-19', '鼠', '小暑后', '四', 'Thu', '4', 'Thursday', '190', '28', '求医.治病.破屋.坏垣.余事勿取', '嫁娶.出行', null);
INSERT INTO `t_calendar` VALUES ('20200710', '0', '工作日', '庚子', '五月二十', '6-20', '鼠', '小暑后', '五', 'Fri', '5', 'Friday', '191', '28', '纳采.订盟.嫁娶.移徙.入宅.出行.开市.交易.立券.纳财.会亲友.安香.出火.拆卸.造屋.起基.安床.作灶.挂匾.安葬.破土.启攒.立碑.入殓.移柩', '祈福.上梁.开仓.掘井.牧养', null);
INSERT INTO `t_calendar` VALUES ('20200711', '1', '假日', '庚子', '五月廿一', '6-21', '鼠', '小暑后', '六', 'Sat', '6', 'Saturday', '192', '28', '祭祀.祈福.斋醮.出行.纳采.订盟.安机械.出火.拆卸.修造.动土.起基.移徙.入宅.造庙.入殓.除服.成服.移柩.破土.安葬.谢土', '嫁娶.开市.栽种.合寿木', null);
INSERT INTO `t_calendar` VALUES ('20200712', '1', '假日', '庚子', '五月廿二', '6-22', '鼠', '小暑后', '日', 'Sun', '7', 'Sunday', '193', '28', '祭祀.进人口.纳财.纳畜.牧养.捕捉.余事勿取', '开市.入宅.安床.动土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200713', '0', '工作日', '庚子', '五月廿三', '6-23', '鼠', '小暑后', '一', 'Mon', '1', 'Monday', '194', '29', '祭祀.塑绘.开光.求医.治病.嫁娶.会亲友.放水.掘井.牧养.纳畜.开渠.安碓硙', '造屋.入宅.作灶.入学.安葬.行丧', null);
INSERT INTO `t_calendar` VALUES ('20200714', '0', '工作日', '庚子', '五月廿四', '6-24', '鼠', '小暑后', '二', 'Tue', '2', 'Tuesday', '195', '29', '祭祀.塞穴.结网.畋猎.余事勿取', '移徙.开市.入宅.嫁娶.开光.安门', null);
INSERT INTO `t_calendar` VALUES ('20200715', '0', '工作日', '庚子', '五月廿五', '6-25', '鼠', '小暑后', '三', 'Wed', '3', 'Wednesday', '196', '29', '开市.纳财.祭祀.塑绘.安机械.冠笄.会亲友.裁衣.开仓.经络.纳畜.造畜椆栖.教牛马.牧养', '动土.破土.安葬.治病', null);
INSERT INTO `t_calendar` VALUES ('20200716', '0', '工作日', '庚子', '五月廿六', '6-26', '鼠', '小暑后', '四', 'Thu', '4', 'Thursday', '197', '29', '移徙.入宅.治病.会亲友.祭祀.祈福.斋醮.安香.移徙.嫁娶.造屋.起基', '开市.斋醮.安床.出行.经络', null);
INSERT INTO `t_calendar` VALUES ('20200717', '0', '工作日', '庚子', '五月廿七', '6-27', '鼠', '小暑后', '五', 'Fri', '5', 'Friday', '198', '29', '塑绘.出行.冠笄.嫁娶.进人口.裁衣.纳婿.造畜椆栖.交易.立券.牧养.开生坟.入殓.除服.成服.移柩.安葬.启攒', null, null);
INSERT INTO `t_calendar` VALUES ('20200718', '1', '假日', '庚子', '五月廿八', '6-28', '鼠', '小暑后', '六', 'Sat', '6', 'Saturday', '199', '29', '祭祀.冠笄.嫁娶.捕捉.结网.畋猎.取渔.余事勿取', '余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20200719', '1', '假日', '庚子', '五月廿九', '6-29', '鼠', '小暑后', '日', 'Sun', '7', 'Sunday', '200', '29', '沐浴.扫舍.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200720', '0', '工作日', '庚子', '五月三十', '6-30', '鼠', '小暑后', '一', 'Mon', '1', 'Monday', '201', '30', '纳采.祭祀.祈福.解除.动土.破土.安葬', '嫁娶.移徙.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200721', '0', '工作日', '庚子', '六月初一', '7-1', '鼠', '小暑后', '二', 'Tue', '2', 'Tuesday', '202', '30', '祭祀.破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200722', '0', '工作日', '庚子', '六月初二', '7-2', '鼠', '小暑后', '三', 'Wed', '3', 'Wednesday', '203', '30', '嫁娶.纳采.开市.出行.动土.上梁.移徙.入宅.破土.安葬', '祭祀.祈福', null);
INSERT INTO `t_calendar` VALUES ('20200723', '0', '工作日', '庚子', '六月初三', '7-3', '鼠', '大暑', '四', 'Thu', '4', 'Thursday', '204', '30', '嫁娶.纳采.开市.出行.动土.上梁.移徙.入宅.破土.安葬', '赴任', null);
INSERT INTO `t_calendar` VALUES ('20200724', '0', '工作日', '庚子', '六月初四', '7-4', '鼠', '大暑后', '五', 'Fri', '5', 'Friday', '205', '30', '祭祀.作灶.纳财.捕捉', '开市.破土', null);
INSERT INTO `t_calendar` VALUES ('20200725', '1', '假日', '庚子', '六月初五', '7-5', '鼠', '大暑后', '六', 'Sat', '6', 'Saturday', '206', '30', '嫁娶.开市.立券.祭祀.祈福.动土.移徙.入宅', '造庙.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200726', '1', '假日', '庚子', '六月初六', '7-6', '鼠', '大暑后', '日', 'Sun', '7', 'Sunday', '207', '30', '补垣.塞穴.结网.入殓.除服.成服.移柩.安葬.启攒.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200727', '0', '工作日', '庚子', '六月初七', '7-7', '鼠', '大暑后', '一', 'Mon', '1', 'Monday', '208', '31', '嫁娶.纳采.出行.祭祀.祈福.解除.移徙.入宅', '动土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200728', '0', '工作日', '庚子', '六月初八', '7-8', '鼠', '大暑后', '二', 'Tue', '2', 'Tuesday', '209', '31', '嫁娶.祭祀.祈福.斋醮.治病.破土.安葬', '开市.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200729', '0', '工作日', '庚子', '六月初九', '7-9', '鼠', '大暑后', '三', 'Wed', '3', 'Wednesday', '210', '31', '嫁娶.出行.开市.安床.入殓.启攒.安葬', '祈福.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200730', '0', '工作日', '庚子', '六月初十', '7-10', '鼠', '大暑后', '四', 'Thu', '4', 'Thursday', '211', '31', '嫁娶.祭祀.裁衣.结网.冠笄.沐浴', '开仓.出货财.置产.安葬.动土.破土.掘井.栽种', null);
INSERT INTO `t_calendar` VALUES ('20200731', '0', '工作日', '庚子', '六月十一', '7-11', '鼠', '大暑后', '五', 'Fri', '5', 'Friday', '212', '31', '入宅.移徙.安床.开光.祈福.求嗣.进人口.开市.交易.立券.出火.拆卸.修造.动土', '嫁娶.破土.置产.栽种.安葬.修坟.行丧', null);
INSERT INTO `t_calendar` VALUES ('20200801', '1', '假日', '庚子', '六月十二', '7-12', '鼠', '大暑后', '六', 'Sat', '6', 'Saturday', '213', '31', '祭祀.解除.沐浴.整手足甲.入殓.移柩.破土.启攒.安葬', '嫁娶.入宅.移徙.作灶.开市.交易.安门.栽种', null);
INSERT INTO `t_calendar` VALUES ('20200802', '1', '假日', '庚子', '六月十三', '7-13', '鼠', '大暑后', '日', 'Sun', '7', 'Sunday', '214', '31', '破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200803', '0', '工作日', '庚子', '六月十四', '7-14', '鼠', '大暑后', '一', 'Mon', '1', 'Monday', '215', '32', '嫁娶.开光.出行.理发.作梁.出火.拆卸.修造.开市.交易.立券.挂匾.动土.入宅.移徙.安床.栽种', '伐木.祭祀.纳畜.祭祀', null);
INSERT INTO `t_calendar` VALUES ('20200804', '0', '工作日', '庚子', '六月十五', '7-15', '鼠', '大暑后', '二', 'Tue', '2', 'Tuesday', '216', '32', '嫁娶.开光.出行.祈福.求嗣.解除.拆卸.动土.修造.进人口.开市.交易.立券.挂匾.入宅.移徙.安床.栽种.纳畜.入殓.移柩.安葬', null, null);
INSERT INTO `t_calendar` VALUES ('20200805', '0', '工作日', '庚子', '六月十六', '7-16', '鼠', '大暑后', '三', 'Wed', '3', 'Wednesday', '217', '32', '祭祀.作灶.纳财.栽种.纳畜.进人口', '安葬.经络.修坟.破土.开市.安床.启攒.立碑', null);
INSERT INTO `t_calendar` VALUES ('20200806', '0', '工作日', '庚子', '六月十七', '7-17', '鼠', '大暑后', '四', 'Thu', '4', 'Thursday', '218', '32', '祭祀.祈福.求嗣.开光.开市.牧养.理发', '嫁娶.出行.安葬.入殓.入宅.作灶.冠笄.上梁', null);
INSERT INTO `t_calendar` VALUES ('20200807', '0', '工作日', '庚子', '六月十八', '7-18', '鼠', '大暑后', '五', 'Fri', '5', 'Friday', '219', '32', '嫁娶.订盟.纳采.祭祀.斋醮.普渡.解除.出行.会亲友.开市.纳财.修造.动土.竖柱.上梁.开光.开仓.出货财.纳畜.牧养.开池.破土.启攒', '出火.入宅.造屋.安门.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200808', '1', '假日', '庚子', '六月十九', '7-19', '鼠', '立秋', '六', 'Sat', '6', 'Saturday', '220', '32', '嫁娶.普渡.祭祀.祈福.补垣.塞穴.断蚁.筑堤.入殓.除服.成服.安葬', '动土.破土.掘井.开光.上梁.词讼', null);
INSERT INTO `t_calendar` VALUES ('20200809', '1', '假日', '庚子', '六月二十', '7-20', '鼠', '立秋后', '日', 'Sun', '7', 'Sunday', '221', '32', '嫁娶.冠笄.祭祀.沐浴.普渡.出行.纳财.扫舍.纳畜.赴任', '开市.动土.破土.安床.开仓.上梁', null);
INSERT INTO `t_calendar` VALUES ('20200810', '0', '工作日', '庚子', '六月廿一', '7-21', '鼠', '立秋后', '一', 'Mon', '1', 'Monday', '222', '33', '祭祀.沐浴.理发.整手足甲.冠笄.解除.入殓.移柩.破土.启攒.安葬', '嫁娶.出行.入宅.开市.安门', null);
INSERT INTO `t_calendar` VALUES ('20200811', '0', '工作日', '庚子', '六月廿二', '7-22', '鼠', '立秋后', '二', 'Tue', '2', 'Tuesday', '223', '33', '塑绘.冠笄.嫁娶.会亲友.进人口.经络.裁衣.栽种.纳畜.牧养.补垣.塞穴.捕捉', '祈福.开市.动土.行丧.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200812', '0', '工作日', '庚子', '六月廿三', '7-23', '鼠', '立秋后', '三', 'Wed', '3', 'Wednesday', '224', '33', '出行.沐浴.订盟.纳采.裁衣.竖柱.上梁.移徙.纳畜.牧养', '嫁娶.安门.动土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200813', '0', '工作日', '庚子', '六月廿四', '7-24', '鼠', '立秋后', '四', 'Thu', '4', 'Thursday', '225', '33', '纳采.订盟.嫁娶.祭祀.祈福.普渡.开光.安香.出火.移徙.入宅.竖柱.修造.动土.竖柱.上梁.起基.造屋.安门.造庙.造桥.破土.启攒.安葬', '开市.立券.纳财.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200814', '0', '工作日', '庚子', '六月廿五', '7-25', '鼠', '立秋后', '五', 'Fri', '5', 'Friday', '226', '33', '祭祀.捕捉.畋猎.纳畜.牧养.入殓.除服.成服.移柩.破土.安葬.启攒', '嫁娶.纳采.订盟.开市.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200815', '1', '假日', '庚子', '六月廿六', '7-26', '鼠', '立秋后', '六', 'Sat', '6', 'Saturday', '227', '33', '破屋.坏垣.治病.余事勿取', '行丧.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200816', '1', '假日', '庚子', '六月廿七', '7-27', '鼠', '立秋后', '日', 'Sun', '7', 'Sunday', '228', '33', '祈福.斋醮.出行.冠笄.嫁娶.雕刻.开柱眼.入宅.造桥.开市.交易.立券.纳财.入殓.除服.成服.移柩.破土.安葬.启攒', '动土.破土.订盟.安床.开池', null);
INSERT INTO `t_calendar` VALUES ('20200817', '0', '工作日', '庚子', '六月廿八', '7-28', '鼠', '立秋后', '一', 'Mon', '1', 'Monday', '229', '34', '祈福.求嗣.解除.订盟.纳采.动土.起基.放水.造仓.开市.纳畜.牧养.开生坟.入殓.除服.成服.移柩.破土.安葬', null, null);
INSERT INTO `t_calendar` VALUES ('20200818', '0', '工作日', '庚子', '六月廿九', '7-29', '鼠', '立秋后', '二', 'Tue', '2', 'Tuesday', '230', '34', '塑绘.开光.解除.订盟.纳采.嫁娶.出火.修造.动土.移徙.入宅.拆卸.起基.安门.分居.开市.交易.立券.纳财.纳畜.牧养', null, null);
INSERT INTO `t_calendar` VALUES ('20200819', '0', '工作日', '庚子', '七月初一', '8-1', '鼠', '立秋后', '三', 'Wed', '3', 'Wednesday', '231', '34', '祈福.出行.订盟.纳采.嫁娶.裁衣.动土.安床.放水.开市.掘井.交易.立券.栽种.开渠.除服.成服.移柩.破土', null, null);
INSERT INTO `t_calendar` VALUES ('20200820', '0', '工作日', '庚子', '七月初二', '8-2', '鼠', '立秋后', '四', 'Thu', '4', 'Thursday', '232', '34', '嫁娶.祭祀.祈福.斋醮.作灶.移徙.入宅', '动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200821', '0', '工作日', '庚子', '七月初三', '8-3', '鼠', '立秋后', '五', 'Fri', '5', 'Friday', '233', '34', '嫁娶.出行.纳畜.祭祀.入殓.启攒.安葬', '作灶.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200822', '1', '假日', '庚子', '七月初四', '8-4', '鼠', '立秋后', '六', 'Sat', '6', 'Saturday', '234', '34', '订盟.纳采.祭祀.祈福.修造.动土.上梁.破土.安葬', '嫁娶.开市', null);
INSERT INTO `t_calendar` VALUES ('20200823', '1', '假日', '庚子', '七月初五', '8-5', '鼠', '处暑', '日', 'Sun', '7', 'Sunday', '235', '34', '订盟.纳采.出行.会亲友.修造.上梁.移徙.入宅', '开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200824', '0', '工作日', '庚子', '七月初六', '8-6', '鼠', '处暑后', '一', 'Mon', '1', 'Monday', '236', '35', '沐浴.修饰垣墙.平治道涂.余事勿取', '嫁娶.祈福.余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20200825', '0', '工作日', '庚子', '七月初七', '8-7', '鼠', '处暑后', '二', 'Tue', '2', 'Tuesday', '237', '35', '嫁娶.祭祀.祈福.斋醮.动土.移徙.入宅', '开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200826', '0', '工作日', '庚子', '七月初八', '8-8', '鼠', '处暑后', '三', 'Wed', '3', 'Wednesday', '238', '35', '捕捉.结网.入殓.破土.安葬', '嫁娶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200827', '0', '工作日', '庚子', '七月初九', '8-9', '鼠', '处暑后', '四', 'Thu', '4', 'Thursday', '239', '35', '沐浴.治病.破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200828', '0', '工作日', '庚子', '七月初十', '8-10', '鼠', '处暑后', '五', 'Fri', '5', 'Friday', '240', '35', '嫁娶.订盟.纳采.出行.开市.祭祀.祈福.移徙.入宅.启攒.安葬', '动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20200829', '1', '假日', '庚子', '七月十一', '8-11', '鼠', '处暑后', '六', 'Sat', '6', 'Saturday', '241', '35', '嫁娶.订盟.纳采.祭祀.祈福.求医.治病.动土.移徙.入宅.破土.安葬', '开光.针灸', null);
INSERT INTO `t_calendar` VALUES ('20200830', '1', '假日', '庚子', '七月十二', '8-12', '鼠', '处暑后', '日', 'Sun', '7', 'Sunday', '242', '35', '订盟.纳采.祭祀.祈福.安机械.作灶.纳畜', '动土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200831', '0', '工作日', '庚子', '七月十三', '8-13', '鼠', '处暑后', '一', 'Mon', '1', 'Monday', '243', '36', '嫁娶.祭祀.祈福.求嗣.出行.动土.安床.掘井.破土.启攒', '入宅.作梁.安门.伐木.修造.上梁.入殓.造屋', null);
INSERT INTO `t_calendar` VALUES ('20200901', '0', '工作日', '庚子', '七月十四', '8-14', '鼠', '处暑后', '二', 'Tue', '2', 'Tuesday', '244', '36', '嫁娶.祭祀.祈福.求嗣.出行.出火.拆卸.修造.移徙.动土.安床.入殓.破土.安葬.启攒', '造屋.开光.理发.造船.掘井.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200902', '0', '工作日', '庚子', '七月十五', '8-15', '鼠', '处暑后', '三', 'Wed', '3', 'Wednesday', '245', '36', '祭祀.祈福.求嗣.开光.出行.解除.上梁.造屋.移徙.安门.纳财.牧养.纳畜.安葬.启攒.入殓', '破土.置产.掘井.动土.安床', null);
INSERT INTO `t_calendar` VALUES ('20200903', '0', '工作日', '庚子', '七月十六', '8-16', '鼠', '处暑后', '四', 'Thu', '4', 'Thursday', '246', '36', '祭祀.解除.沐浴.理发.整手足甲.入殓.移柩.破土.安葬.扫舍', '嫁娶.会亲友.进人口.出行.入宅.移徙.赴任.作灶', null);
INSERT INTO `t_calendar` VALUES ('20200904', '0', '工作日', '庚子', '七月十七', '8-17', '鼠', '处暑后', '五', 'Fri', '5', 'Friday', '247', '36', '塑绘.开光.进人口.纳畜.补垣.塞穴.栽种.牧养', '嫁娶.纳财.祈福.安葬.修造.开市.交易.立券.动土.上梁', null);
INSERT INTO `t_calendar` VALUES ('20200905', '1', '假日', '庚子', '七月十八', '8-18', '鼠', '处暑后', '六', 'Sat', '6', 'Saturday', '248', '36', '祭祀.作灶.沐浴.修饰垣墙.平治道涂.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200906', '1', '假日', '庚子', '七月十九', '8-19', '鼠', '处暑后', '日', 'Sun', '7', 'Sunday', '249', '36', '祭祀.求嗣.开光.出行.伐木.作梁.出火.解除.拆卸.进人口.修造.动土.起基.安床.栽种.纳畜.入殓.破土.安葬.除服.成服', '嫁娶.移徙', null);
INSERT INTO `t_calendar` VALUES ('20200907', '0', '工作日', '庚子', '七月二十', '8-20', '鼠', '处暑后', '一', 'Mon', '1', 'Monday', '250', '37', '嫁娶.造车器.安机械.祭祀.祈福.开光.安香.出火.出行.开市.立券.修造.动土.移徙.入宅.破土.安葬', '纳采.订盟.架马.词讼.开渠', null);
INSERT INTO `t_calendar` VALUES ('20200908', '0', '工作日', '庚子', '七月廿一', '8-21', '鼠', '白露', '二', 'Tue', '2', 'Tuesday', '251', '37', '沐浴.捕捉.入殓.除服.成服.破土.启攒.安葬', '祭祀.嫁娶.安床.开市.入宅.探病.上梁', null);
INSERT INTO `t_calendar` VALUES ('20200909', '0', '工作日', '庚子', '七月廿二', '8-22', '鼠', '白露后', '三', 'Wed', '3', 'Wednesday', '252', '37', '余事勿取', '探病.余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20200910', '0', '工作日', '庚子', '七月廿三', '8-23', '鼠', '白露后', '四', 'Thu', '4', 'Thursday', '253', '37', '订盟.纳采.祭祀.祈福.安香.出火.修造.动土.上梁.安门.起基.竖柱.上梁.定磉.开池.移徙.入宅.立券.破土', '嫁娶.造庙.造桥.造船.作灶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200911', '0', '工作日', '庚子', '七月廿四', '8-24', '鼠', '白露后', '五', 'Fri', '5', 'Friday', '254', '37', '开光.求嗣.雕刻.嫁娶.订盟.纳采.出火.拆卸.修造.动土.起基.上梁.放水.移徙.入宅.造仓.造船.开市.开池.纳畜.牧养.挂匾', '行丧.安葬.合寿木', null);
INSERT INTO `t_calendar` VALUES ('20200912', '1', '假日', '庚子', '七月廿五', '8-25', '鼠', '白露后', '六', 'Sat', '6', 'Saturday', '255', '37', '祭祀.嫁娶.捕捉', '开光.动土.破土.开市.修造.入宅.安门', null);
INSERT INTO `t_calendar` VALUES ('20200913', '1', '假日', '庚子', '七月廿六', '8-26', '鼠', '白露后', '日', 'Sun', '7', 'Sunday', '256', '37', '祭祀.普渡.解除.会亲友.捕捉.畋猎.启攒.除服.成服.移柩', '嫁娶.开市.动土.掘井.开池.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200914', '0', '工作日', '庚子', '七月廿七', '8-27', '鼠', '白露后', '一', 'Mon', '1', 'Monday', '257', '38', '祭祀.出行.解除.冠笄.嫁娶.伐木.架马.开柱眼.修造.动土.移徙.入宅.开生坟.合寿木.入殓.移柩.破土.安葬.修坟', '开光.安床', null);
INSERT INTO `t_calendar` VALUES ('20200915', '0', '工作日', '庚子', '七月廿八', '8-28', '鼠', '白露后', '二', 'Tue', '2', 'Tuesday', '258', '38', '祭祀.祈福.求嗣.出行.沐浴.交易.扫舍.教牛马', '动土.作灶.行丧.安葬.修坟', null);
INSERT INTO `t_calendar` VALUES ('20200916', '0', '工作日', '庚子', '七月廿九', '8-29', '鼠', '白露后', '三', 'Wed', '3', 'Wednesday', '259', '38', '出行.解除.纳采.冠笄.雕刻.修造.动土.起基.上梁.合脊.安床.移徙.入宅.开市.栽种.作厕', '造庙.安门.行丧.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200917', '0', '工作日', '庚子', '八月初一', '9-1', '鼠', '白露后', '四', 'Thu', '4', 'Thursday', '260', '38', '祭祀.沐浴.解除.理发.冠笄.安机械.作灶.造仓.开市.开池.作厕.补垣.塞穴.断蚁.结网', '嫁娶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200918', '0', '工作日', '庚子', '八月初二', '9-2', '鼠', '白露后', '五', 'Fri', '5', 'Friday', '261', '38', '祭祀.沐浴.修饰垣墙.平治道涂', '嫁娶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20200919', '1', '假日', '庚子', '八月初三', '9-3', '鼠', '白露后', '六', 'Sat', '6', 'Saturday', '262', '38', '祭祀.会亲友.纳采.嫁娶.开光.塑绘.斋醮.安香.开市.立券.除服.成服.入殓.移柩.安葬.赴任.进人口.出行.裁衣.修造.动土.上梁.经络.交易', '入宅.伐木', null);
INSERT INTO `t_calendar` VALUES ('20200920', '1', '假日', '庚子', '八月初四', '9-4', '鼠', '白露后', '日', 'Sun', '7', 'Sunday', '263', '38', '祭祀.冠笄.会亲友.拆卸.起基.除服.成服.移柩.启攒.安葬.沐浴.捕捉.开光.塑绘', '作灶.祭祀.入宅.嫁娶', null);
INSERT INTO `t_calendar` VALUES ('20200921', '0', '工作日', '庚子', '八月初五', '9-5', '鼠', '白露后', '一', 'Mon', '1', 'Monday', '264', '39', '祭祀.沐浴.破屋.坏垣.余事勿取', '移徙.入宅.出行.栽种', null);
INSERT INTO `t_calendar` VALUES ('20200922', '0', '工作日', '庚子', '八月初六', '9-6', '鼠', '白露后', '二', 'Tue', '2', 'Tuesday', '265', '39', '祭祀.塑绘.开光.出行.解除.订盟.嫁娶.拆卸.起基.安床.入宅.开市.入殓.除服.成服.移柩.破土.谢土.挂匾.开柱眼.交易', '造桥.冠笄.造屋.掘井', null);
INSERT INTO `t_calendar` VALUES ('20200923', '0', '工作日', '庚子', '八月初七', '9-7', '鼠', '秋分', '三', 'Wed', '3', 'Wednesday', '266', '39', '祭祀.赴任.动土.上梁.开光.塑绘.冠笄.拆卸.起基.安床.开市.立券.赴任.经络', '定磉.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200924', '0', '工作日', '庚子', '八月初八', '9-8', '鼠', '秋分后', '四', 'Thu', '4', 'Thursday', '267', '39', '祭祀.裁衣.冠笄.嫁娶.纳婿.会亲友.除服.成服.移柩.捕捉.进人口.入殓', '移徙.入宅.作灶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20200925', '0', '工作日', '庚子', '八月初九', '9-9', '鼠', '秋分后', '五', 'Fri', '5', 'Friday', '268', '39', '祭祀.诸事不宜', '入殓.安葬.开市.交易', null);
INSERT INTO `t_calendar` VALUES ('20200926', '1', '假日', '庚子', '八月初十', '9-10', '鼠', '秋分后', '六', 'Sat', '6', 'Saturday', '269', '39', '祭祀.裁衣.冠笄.嫁娶.安机械.拆卸.动土.起基.移徙.入宅.入殓.启攒.安葬.造仓.经络', '安床.开光.开市.交易', null);
INSERT INTO `t_calendar` VALUES ('20200927', '0', '工作日', '庚子', '八月十一', '9-11', '鼠', '秋分后', '日', 'Sun', '7', 'Sunday', '270', '39', '祭祀.出行.成服.除服.沐浴.入殓', '动土.冠笄.移徙.入宅.开市.竖柱.上梁', null);
INSERT INTO `t_calendar` VALUES ('20200928', '0', '工作日', '庚子', '八月十二', '9-12', '鼠', '秋分后', '一', 'Mon', '1', 'Monday', '271', '40', '祭祀.沐浴.赴任.出行.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200929', '0', '工作日', '庚子', '八月十三', '9-13', '鼠', '秋分后', '二', 'Tue', '2', 'Tuesday', '272', '40', '诸事不宜', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20200930', '0', '工作日', '庚子', '八月十四', '9-14', '鼠', '秋分后', '三', 'Wed', '3', 'Wednesday', '273', '40', '沐浴.入殓.移柩.除服.成服.破土.平治道涂', '嫁娶.移徙.入宅.开市', null);
INSERT INTO `t_calendar` VALUES ('20201001', '2', '节日', '庚子', '八月十五', '9-15', '鼠', '秋分后', '四', 'Thu', '4', 'Thursday', '274', '40', '嫁娶.祭祀.祈福.求嗣.沐浴.出火.出行.拆卸.修造.动土.进人口.开市.交易.立券.入宅.移徙.安床.栽种.纳畜.入殓.安葬.启攒.除服.成服', null, null);
INSERT INTO `t_calendar` VALUES ('20201002', '2', '节日', '庚子', '八月十六', '9-16', '鼠', '秋分后', '五', 'Fri', '5', 'Friday', '275', '40', '开光.解除.起基.动土.拆卸.上梁.立碑.修坟.安葬.破土.启攒.移柩', '嫁娶.出行.安床.作灶.祭祀.入宅.移徙.出火.进人口.置产', null);
INSERT INTO `t_calendar` VALUES ('20201003', '2', '节日', '庚子', '八月十七', '9-17', '鼠', '秋分后', '六', 'Sat', '6', 'Saturday', '276', '40', '破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201004', '1', '假日', '庚子', '八月十八', '9-18', '鼠', '秋分后', '日', 'Sun', '7', 'Sunday', '277', '40', '嫁娶.祈福.求嗣.出行.出火.拆卸.修造.动土.上梁.开光.进人口.开市.交易.立券.挂匾.安床.入宅.移徙.栽种.伐木.入殓.破土.除服.成服', null, null);
INSERT INTO `t_calendar` VALUES ('20201005', '1', '假日', '庚子', '八月十九', '9-19', '鼠', '秋分后', '一', 'Mon', '1', 'Monday', '278', '41', '开市.交易.立券.挂匾.祭祀.开光.进人口.入宅.安床.出火.拆卸.修造.动土.栽种', '嫁娶.立碑.出行.伐木.安葬.行丧.移徙.纳畜', null);
INSERT INTO `t_calendar` VALUES ('20201006', '1', '假日', '庚子', '八月二十', '9-20', '鼠', '秋分后', '二', 'Tue', '2', 'Tuesday', '279', '41', '祭祀.理发.会亲友.进人口.嫁娶.针灸.入殓.移柩', '探病.开渠.安葬.伐木.作灶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20201007', '1', '假日', '庚子', '八月廿一', '9-21', '鼠', '秋分后', '三', 'Wed', '3', 'Wednesday', '280', '41', '祭祀.立碑.修坟.启攒.除服.成服.余事勿取', '余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20201008', '1', '假日', '庚子', '八月廿二', '9-22', '鼠', '秋分后', '四', 'Thu', '4', 'Thursday', '281', '41', '嫁娶.订盟.纳采.祭祀.祈福.出行.求医.治病.出火.移徙.入宅', '开市.开仓.出货财.安床.安门.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201009', '0', '工作日', '庚子', '八月廿三', '9-23', '鼠', '寒露', '五', 'Fri', '5', 'Friday', '282', '41', '冠笄.祭祀.沐浴.作灶.理发.整手足甲.扫舍.补垣.塞穴.入殓.破土.启攒', '开光.嫁娶.会亲友.栽种.针灸.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201010', '0', '工作日', '庚子', '八月廿四', '9-24', '鼠', '寒露后', '六', 'Sat', '6', 'Saturday', '283', '41', '纳采.订盟.嫁娶.祭祀.祈福.求嗣.置产.求医.治病.开市.交易.立券.会亲友.移徙.竖柱.上梁.造屋.合脊.安门.放水.捕捉.纳畜', '造庙.造船.动土.破土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201011', '1', '假日', '庚子', '八月廿五', '9-25', '鼠', '寒露后', '日', 'Sun', '7', 'Sunday', '284', '41', '出行.造车器.造畜椆栖.解除.冠笄.裁衣.作梁.雕刻.会亲友.移徙.入宅.安机械.造畜椆栖.开市.扫舍', '嫁娶.动土.破土.修坟', null);
INSERT INTO `t_calendar` VALUES ('20201012', '0', '工作日', '庚子', '八月廿六', '9-26', '鼠', '寒露后', '一', 'Mon', '1', 'Monday', '285', '42', '沐浴.理发.冠笄.安床.开市.立券.会亲友.交易.纳财.结网.教牛马', '移徙.入宅.出行.祈福.嫁娶', null);
INSERT INTO `t_calendar` VALUES ('20201013', '0', '工作日', '庚子', '八月廿七', '9-27', '鼠', '寒露后', '二', 'Tue', '2', 'Tuesday', '286', '42', '祭祀.造畜椆栖.修饰垣墙.平治道涂.余事勿取', '嫁娶.开市.安床.掘井', null);
INSERT INTO `t_calendar` VALUES ('20201014', '0', '工作日', '庚子', '八月廿八', '9-28', '鼠', '寒露后', '三', 'Wed', '3', 'Wednesday', '287', '42', '捕捉.结网.入殓.除服.成服.移柩.破土.安葬.启攒.立碑', '嫁娶.祭祀.入宅.造屋.移徙', null);
INSERT INTO `t_calendar` VALUES ('20201015', '0', '工作日', '庚子', '八月廿九', '9-29', '鼠', '寒露后', '四', 'Thu', '4', 'Thursday', '288', '42', '祭祀.祈福.求嗣.斋醮.造庙.出火.安机械.会亲友.开市.交易.立券.纳财.习艺.经络.求医.治病.开池.作厕.畋猎.结网.栽种.牧养.安葬.破土.启攒', '开光.嫁娶.掘井.伐木.作梁', null);
INSERT INTO `t_calendar` VALUES ('20201016', '0', '工作日', '庚子', '八月三十', '9-30', '鼠', '寒露后', '五', 'Fri', '5', 'Friday', '289', '42', '破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201017', '1', '假日', '庚子', '九月初一', '10-1', '鼠', '寒露后', '六', 'Sat', '6', 'Saturday', '290', '42', '会亲友.嫁娶.订盟.纳采.纳婿.拆卸.修造.动土.起基.竖柱.上梁.安床.会亲友.纳财', '出行.祈福.安葬.作灶', null);
INSERT INTO `t_calendar` VALUES ('20201018', '1', '假日', '庚子', '九月初二', '10-2', '鼠', '寒露后', '日', 'Sun', '7', 'Sunday', '291', '42', '祭祀.塑绘.开光.祈福.斋醮.出行.订盟.纳采.裁衣.嫁娶.拆卸.修造.安床.入宅.安香.入殓.启攒.安葬.谢土.赴任.会亲友.进人口.出行.移徙.上梁.经络.开市.交易.立券.纳财', '开仓.冠笄.伐木.作梁', null);
INSERT INTO `t_calendar` VALUES ('20201019', '0', '工作日', '庚子', '九月初三', '10-3', '鼠', '寒露后', '一', 'Mon', '1', 'Monday', '292', '43', '祭祀.作灶.入殓.除服.成服.畋猎', '栽种.动土.安葬.开市', null);
INSERT INTO `t_calendar` VALUES ('20201020', '0', '工作日', '庚子', '九月初四', '10-4', '鼠', '寒露后', '二', 'Tue', '2', 'Tuesday', '293', '43', '祭祀.祈福.斋醮.沐浴.竖柱.订盟.纳采.嫁娶.拆卸.入宅.移柩.启攒.谢土.赴任.出火.纳畜', '作灶.入殓.安葬.安床', null);
INSERT INTO `t_calendar` VALUES ('20201021', '0', '工作日', '庚子', '九月初五', '10-5', '鼠', '寒露后', '三', 'Wed', '3', 'Wednesday', '294', '43', '嫁娶.祭祀.安机械.入殓.破土.安葬', '动土.上梁', null);
INSERT INTO `t_calendar` VALUES ('20201022', '0', '工作日', '庚子', '九月初六', '10-6', '鼠', '寒露后', '四', 'Thu', '4', 'Thursday', '295', '43', '作灶.造畜椆栖', '行丧.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201023', '0', '工作日', '庚子', '九月初七', '10-7', '鼠', '寒露后', '五', 'Fri', '5', 'Friday', '296', '43', '沐浴.理发.入学.习艺.进人口', '嫁娶.入宅', null);
INSERT INTO `t_calendar` VALUES ('20201024', '1', '假日', '庚子', '九月初八', '10-8', '鼠', '霜降', '六', 'Sat', '6', 'Saturday', '297', '43', '开光.针灸.会亲友.启攒.安葬', '开市.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20201025', '1', '假日', '庚子', '九月初九', '10-9', '鼠', '霜降后', '日', 'Sun', '7', 'Sunday', '298', '43', '祭祀.结网.造畜椆栖.余事勿取', '余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20201026', '0', '工作日', '庚子', '九月初十', '10-10', '鼠', '霜降后', '一', 'Mon', '1', 'Monday', '299', '44', '入殓.除服.成服.移柩.破土.启攒.安葬', '移徙.入宅', null);
INSERT INTO `t_calendar` VALUES ('20201027', '0', '工作日', '庚子', '九月十一', '10-11', '鼠', '霜降后', '二', 'Tue', '2', 'Tuesday', '300', '44', '嫁娶.订盟.纳采.出行.祭祀.祈福.动土.移徙.入宅.破土.安葬', '开市.赴任', null);
INSERT INTO `t_calendar` VALUES ('20201028', '0', '工作日', '庚子', '九月十二', '10-12', '鼠', '霜降后', '三', 'Wed', '3', 'Wednesday', '301', '44', '祭祀.解除.破屋.坏垣.余事勿取', '余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20201029', '0', '工作日', '庚子', '九月十三', '10-13', '鼠', '霜降后', '四', 'Thu', '4', 'Thursday', '302', '44', '订盟.纳采.会亲友.安机械.纳财.牧养', '祈福.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201030', '0', '工作日', '庚子', '九月十四', '10-14', '鼠', '霜降后', '五', 'Fri', '5', 'Friday', '303', '44', '嫁娶.订盟.纳采.出行.开市.祭祀.祈福.动土.移徙.入宅.破土.安葬', '斋醮.安门', null);
INSERT INTO `t_calendar` VALUES ('20201031', '1', '假日', '庚子', '九月十五', '10-15', '鼠', '霜降后', '六', 'Sat', '6', 'Saturday', '304', '44', '祭祀.塞穴.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201101', '1', '假日', '庚子', '九月十六', '10-16', '鼠', '霜降后', '日', 'Sun', '7', 'Sunday', '305', '44', '祭祀.祈福.求嗣.开光.开市.出行.解除.动土.起基.置产.栽种', '嫁娶.作灶.修坟.安门.入宅.立碑.安葬.安床', null);
INSERT INTO `t_calendar` VALUES ('20201102', '0', '工作日', '庚子', '九月十七', '10-17', '鼠', '霜降后', '一', 'Mon', '1', 'Monday', '306', '45', '祭祀.解除.裁衣.理发.安床.作灶.造畜椆栖.放水.筑堤.补垣.塞穴.整手足甲.扫舍', '嫁娶.开光.会亲友.掘井.安门.栽种', null);
INSERT INTO `t_calendar` VALUES ('20201103', '0', '工作日', '庚子', '九月十八', '10-18', '鼠', '霜降后', '二', 'Tue', '2', 'Tuesday', '307', '45', '祭祀.出行.裁衣.冠笄.会亲友.造畜椆栖.嫁娶.竖柱.上梁.移徙.纳财.纳畜', '动土.伐木.作梁.行丧.安葬.开生坟', null);
INSERT INTO `t_calendar` VALUES ('20201104', '0', '工作日', '庚子', '九月十九', '10-19', '鼠', '霜降后', '三', 'Wed', '3', 'Wednesday', '308', '45', '祭祀.祈福.求嗣.开光.出行.解除.移徙.伐木.安床.纳畜.出火.拆卸', '安葬.修坟.作灶.破土.造庙.动土.嫁娶.纳采', null);
INSERT INTO `t_calendar` VALUES ('20201105', '0', '工作日', '庚子', '九月二十', '10-20', '鼠', '霜降后', '四', 'Thu', '4', 'Thursday', '309', '45', '开市.交易.立券.纳财.会亲友.开光.理发.入殓.移柩.安葬.启攒', '嫁娶.作灶.出火.出行.入宅.移徙.安床.祈福.上梁', null);
INSERT INTO `t_calendar` VALUES ('20201106', '0', '工作日', '庚子', '九月廿一', '10-21', '鼠', '霜降后', '五', 'Fri', '5', 'Friday', '310', '45', '造畜椆栖.平治道涂.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201107', '1', '假日', '庚子', '九月廿二', '10-22', '鼠', '霜降后', '六', 'Sat', '6', 'Saturday', '311', '45', '纳采.移徙.纳财.开市.交易.立券.纳财.入宅.修造.动土.竖柱.起基.定磉.造庙.安香.出火.修饰垣墙.平治道涂.会亲友.出行.开池.作厕', '开仓.造屋.造桥.祭祀', null);
INSERT INTO `t_calendar` VALUES ('20201108', '1', '假日', '庚子', '九月廿三', '10-23', '鼠', '立冬', '日', 'Sun', '7', 'Sunday', '312', '45', '订盟.纳采.纳财.开市.立券.祭祀.祈福.移徙.入宅.出行.造屋.起基.修造.动土.竖柱.上梁.安门.安香.出火.教牛马.会亲友.破土', '嫁娶.安葬.掘井.置产.造船', null);
INSERT INTO `t_calendar` VALUES ('20201109', '0', '工作日', '庚子', '九月廿四', '10-24', '鼠', '立冬后', '一', 'Mon', '1', 'Monday', '313', '46', '嫁娶.订盟.纳采.祭祀.祈福.塑绘.开光.移徙.安床.伐木.作梁.捕捉.畋猎.结网.求医.治病.解除.安葬.除服.成服.移柩.入殓.立碑.谢土', '开市.造庙.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20201110', '0', '工作日', '庚子', '九月廿五', '10-25', '鼠', '立冬后', '二', 'Tue', '2', 'Tuesday', '314', '46', '破屋.坏垣.祭祀.余事勿取', '嫁娶.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201111', '0', '工作日', '庚子', '九月廿六', '10-26', '鼠', '立冬后', '三', 'Wed', '3', 'Wednesday', '315', '46', '嫁娶.纳采.订盟.祭祀.冠笄.裁衣.伐木.作梁.架马.定磉.开柱眼.作灶.移徙.安床.畋猎.结网.开池.作厕.除服.成服.启攒.入殓.移柩.安葬', '造屋.造船.动土.破土', null);
INSERT INTO `t_calendar` VALUES ('20201112', '0', '工作日', '庚子', '九月廿七', '10-27', '鼠', '立冬后', '四', 'Thu', '4', 'Thursday', '316', '46', '纳采.订盟.祭祀.祈福.求嗣.斋醮.开光.会亲友.解除.入学.纳财.交易.立券.经络.起基.动土.定磉.开池.栽种.纳畜.牧养.破土.入殓.立碑.安葬', '嫁娶.开市.入宅.出火.移徙', null);
INSERT INTO `t_calendar` VALUES ('20201113', '0', '工作日', '庚子', '九月廿八', '10-28', '鼠', '立冬后', '五', 'Fri', '5', 'Friday', '317', '46', '捕捉.畋猎.会亲友.解除.入殓.除服.成服.移柩.余事勿取', '安床.安门.破土.修坟.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201114', '1', '假日', '庚子', '九月廿九', '10-29', '鼠', '立冬后', '六', 'Sat', '6', 'Saturday', '318', '46', '祭祀.祈福.求嗣.斋醮.沐浴.冠笄.出行.理发.拆卸.解除.起基.动土.定磉.安碓硙.开池.掘井.扫舍.除服.成服.移柩.启攒.立碑.谢土', '移徙.入宅.安门.作梁.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201115', '1', '假日', '庚子', '十月初一', '10-1', '鼠', '立冬后', '日', 'Sun', '7', 'Sunday', '319', '46', '嫁娶.冠笄.安床.纳采.会亲友.塞穴.捕捉.置产.造畜椆栖', '开光.掘井.安葬.谢土.修坟', null);
INSERT INTO `t_calendar` VALUES ('20201116', '0', '工作日', '庚子', '十月初二', '10-2', '鼠', '立冬后', '一', 'Mon', '1', 'Monday', '320', '47', '祭祀.沐浴.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201117', '0', '工作日', '庚子', '十月初三', '10-3', '鼠', '立冬后', '二', 'Tue', '2', 'Tuesday', '321', '47', '祭祀.会亲友.嫁娶.沐浴.修造.动土.祈福.开光.塑绘.出行.订盟.纳采.裁衣.入殓.除服.成服.移柩.启攒.赴任.竖柱.上梁.纳财.扫舍.栽种.纳畜.伐木', '入宅.作灶.安床.开仓', null);
INSERT INTO `t_calendar` VALUES ('20201118', '0', '工作日', '庚子', '十月初四', '10-4', '鼠', '立冬后', '三', 'Wed', '3', 'Wednesday', '322', '47', '理发.会亲友.补垣.塞穴.结网', '嫁娶.入宅.安门.移徙', null);
INSERT INTO `t_calendar` VALUES ('20201119', '0', '工作日', '庚子', '十月初五', '10-5', '鼠', '立冬后', '四', 'Thu', '4', 'Thursday', '323', '47', '祭祀.祈福.订盟.纳采.裁衣.拆卸.修造.动土.起基.安床.移徙.入宅.安香.除服.成服.入殓.移柩.安葬.谢土.赴任.会亲友.进人口.出行.竖柱.上梁.经络.开市.交易.立券.纳财.开仓', '作灶.治病.伐木.作梁', null);
INSERT INTO `t_calendar` VALUES ('20201120', '0', '工作日', '庚子', '十月初六', '10-6', '鼠', '立冬后', '五', 'Fri', '5', 'Friday', '324', '47', '祭祀.祈福.订盟.纳采.裁衣.拆卸.修造.动土.起基.安床.移徙.入宅.安香.入殓.移柩.安葬.谢土.赴任.进人口.会亲友', '作灶.治病', null);
INSERT INTO `t_calendar` VALUES ('20201121', '1', '假日', '庚子', '十月初七', '10-7', '鼠', '立冬后', '六', 'Sat', '6', 'Saturday', '325', '47', '祭祀.塑绘.开光.订盟.纳采.嫁娶.安床.进人口.入殓.除服.成服.移柩.启攒.安葬.立碑', '开市.交易.破土.作灶', null);
INSERT INTO `t_calendar` VALUES ('20201122', '1', '假日', '庚子', '十月初八', '10-8', '鼠', '立冬后', '日', 'Sun', '7', 'Sunday', '326', '47', '祭祀.解除.破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201123', '0', '工作日', '庚子', '十月初九', '10-9', '鼠', '小雪', '一', 'Mon', '1', 'Monday', '327', '48', '祭祀.解除.祈福.开光.塑绘.斋醮.订盟.纳采.裁衣.冠笄.拆卸.修造.动土.入殓.除服.成服.移柩.启攒.安床.赴任.出行.移徙.竖柱.上梁.伐木.栽种.破土.安葬.纳畜', '造屋.治病', null);
INSERT INTO `t_calendar` VALUES ('20201124', '0', '工作日', '庚子', '十月初十', '10-10', '鼠', '小雪后', '二', 'Tue', '2', 'Tuesday', '328', '48', '祭祀.祈福.订盟.纳采.裁衣.合帐.冠笄.安机械.安床.造畜椆栖.入殓.移柩.启攒.安葬.谢土.除服.成服.会亲友.竖柱.上梁.经络.开市.交易.立券.纳财.纳畜.筑堤', '嫁娶.入宅.治病.赴任', null);
INSERT INTO `t_calendar` VALUES ('20201125', '0', '工作日', '庚子', '十月十一', '10-11', '鼠', '小雪后', '三', 'Wed', '3', 'Wednesday', '329', '48', '沐浴.扫舍.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201126', '0', '工作日', '庚子', '十月十二', '10-12', '鼠', '小雪后', '四', 'Thu', '4', 'Thursday', '330', '48', '诸事不宜', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201127', '0', '工作日', '庚子', '十月十三', '10-13', '鼠', '小雪后', '五', 'Fri', '5', 'Friday', '331', '48', '祈福.斋醮.出行.订盟.纳采.入殓.移柩.破土.安葬.立碑.结网', '入宅.作灶', null);
INSERT INTO `t_calendar` VALUES ('20201128', '1', '假日', '庚子', '十月十四', '10-14', '鼠', '小雪后', '六', 'Sat', '6', 'Saturday', '332', '48', '祭祀.沐浴.出行.冠笄.进人口.余事勿取', '嫁娶.动土.安葬.作灶', null);
INSERT INTO `t_calendar` VALUES ('20201129', '1', '假日', '庚子', '十月十五', '10-15', '鼠', '小雪后', '日', 'Sun', '7', 'Sunday', '333', '48', '祭祀.祈福.斋醮.塑绘.开光.订盟.纳采.裁衣.冠笄.嫁娶.拆卸.入宅.安香.入殓.移柩.理发.安葬.修坟.谢土.赴任.移徙.沐浴.治病.破土.启攒.整手足甲.入学.作梁', '开市', null);
INSERT INTO `t_calendar` VALUES ('20201130', '0', '工作日', '庚子', '十月十六', '10-16', '鼠', '小雪后', '一', 'Mon', '1', 'Monday', '334', '49', '诸事不宜', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201201', '0', '工作日', '庚子', '十月十七', '10-17', '鼠', '小雪后', '二', 'Tue', '2', 'Tuesday', '335', '49', '开市.交易.立券.挂匾.纳财.开光.出行.入宅.移徙.安床.纳畜.入殓.移柩.安葬', '栽种.破土.置产.祭祀.嫁娶.动土.作灶.祈福', null);
INSERT INTO `t_calendar` VALUES ('20201202', '0', '工作日', '庚子', '十月十八', '10-18', '鼠', '小雪后', '三', 'Wed', '3', 'Wednesday', '336', '49', '嫁娶.祭祀.祈福.求嗣.开光.出行.解除.出火.出行.拆卸.进人口.入宅.移徙.安床.栽种.动土.修造.纳畜.入殓.安葬.立碑.除服.成服', null, null);
INSERT INTO `t_calendar` VALUES ('20201203', '0', '工作日', '庚子', '十月十九', '10-19', '鼠', '小雪后', '四', 'Thu', '4', 'Thursday', '337', '49', '开光.解除.拆卸.修造.动土.安床.纳畜.安葬.启攒.入殓', '嫁娶.开市.出火.栽种.破土.动土.入宅.移徙.安香.分居.掘井.作灶', null);
INSERT INTO `t_calendar` VALUES ('20201204', '0', '工作日', '庚子', '十月二十', '10-20', '鼠', '小雪后', '五', 'Fri', '5', 'Friday', '338', '49', '破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201205', '1', '假日', '庚子', '十月廿一', '10-21', '鼠', '小雪后', '六', 'Sat', '6', 'Saturday', '339', '49', '嫁娶.祭祀.开光.出火.出行.拆卸.修造.动土.解除.开市.交易.立券.挂匾.纳财.入宅.移徙.安床.栽种.纳畜', '探病.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201206', '1', '假日', '庚子', '十月廿二', '10-22', '鼠', '小雪后', '日', 'Sun', '7', 'Sunday', '340', '49', '祭祀.祈福.求嗣.开光.解除.理发.会亲友.栽种.纳畜.牧养.安葬.修坟.立碑.启攒', '入宅.作灶.词讼.移徙.出行.赴任', null);
INSERT INTO `t_calendar` VALUES ('20201207', '0', '工作日', '庚子', '十月廿三', '10-23', '鼠', '小雪后', '一', 'Mon', '1', 'Monday', '341', '50', '纳采.订盟.移徙.入宅.出行.安机械.会亲友.祭祀.祈福.斋醮.开光.安香.出火.解除.求医.针灸.治病.造屋.起基.修造.安门.造船.纳畜.牧养.移柩.入殓.启攒.谢土.修坟.立碑', '嫁娶.动土.安床.造桥.掘井', null);
INSERT INTO `t_calendar` VALUES ('20201208', '0', '工作日', '庚子', '十月廿四', '10-24', '鼠', '大雪', '二', 'Tue', '2', 'Tuesday', '342', '50', '祭祀.沐浴.作灶.纳财.捕捉.畋猎.安床.扫舍', '开市.斋醮.破土.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201209', '0', '工作日', '庚子', '十月廿五', '10-25', '鼠', '大雪后', '三', 'Wed', '3', 'Wednesday', '343', '50', '祈福.斋醮.纳采.订盟.解除.架马.开柱眼.修造.动土.起基.上梁.归岫.造屋.合脊.掘井.除服.成服.破土.栽种', '移徙.开市.入宅.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201210', '0', '工作日', '庚子', '十月廿六', '10-26', '鼠', '大雪后', '四', 'Thu', '4', 'Thursday', '344', '50', '纳采.订盟.祭祀.沐浴.冠笄.合帐.裁衣.修造.动土.拆卸.移徙.入宅.安门.开仓.筑堤.作厕.栽种.纳畜.补垣.塞穴', '嫁娶.祈福.开光.掘井.安葬.行丧', null);
INSERT INTO `t_calendar` VALUES ('20201211', '0', '工作日', '庚子', '十月廿七', '10-27', '鼠', '大雪后', '五', 'Fri', '5', 'Friday', '345', '50', '合帐.裁衣.教牛马.余事勿取', '入宅.动土.破土.嫁娶.作灶.造船', null);
INSERT INTO `t_calendar` VALUES ('20201212', '1', '假日', '庚子', '十月廿八', '10-28', '鼠', '大雪后', '六', 'Sat', '6', 'Saturday', '346', '50', '纳采.订盟.嫁娶.祭祀.祈福.安香.出火.出行.会亲友.经络.求医.治病.解除.拆卸.起基.修造.动土.定磉.扫舍.栽种.牧养.造畜椆栖', '斋醮.作梁.掘井.行丧.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201213', '1', '假日', '庚子', '十月廿九', '10-29', '鼠', '大雪后', '日', 'Sun', '7', 'Sunday', '347', '50', '纳财.开市.交易.立券.会亲友.进人口.经络.祭祀.祈福.安香.出火.求医.治病.修造.动土.拆卸.扫舍.安床.栽种.牧养.开生坟.合寿木.入殓.安葬.启攒', '嫁娶.祈福.出火.移徙.入宅', null);
INSERT INTO `t_calendar` VALUES ('20201214', '0', '工作日', '庚子', '十月三十', '10-30', '鼠', '大雪后', '一', 'Mon', '1', 'Monday', '348', '51', '祭祀.入殓.移柩.余事勿取', '入宅.修造.动土.破土.安门.上梁', null);
INSERT INTO `t_calendar` VALUES ('20201215', '0', '工作日', '庚子', '十一月初一', '11-1', '鼠', '大雪后', '二', 'Tue', '2', 'Tuesday', '349', '51', '塑绘.开光.订盟.纳采.裁衣.冠笄.拆卸.修造.安床.入宅.出火.安葬.谢土.赴任', '掘井.伐木.斋醮.作灶', null);
INSERT INTO `t_calendar` VALUES ('20201216', '0', '工作日', '庚子', '十一月初二', '11-2', '鼠', '大雪后', '三', 'Wed', '3', 'Wednesday', '350', '51', '祭祀.塑绘.开光.裁衣.冠笄.嫁娶.纳采.拆卸.修造.动土.竖柱.上梁.安床.移徙.入宅.安香.结网.捕捉.畋猎.伐木.进人口.放水', '出行.安葬.修坟.开市', null);
INSERT INTO `t_calendar` VALUES ('20201217', '0', '工作日', '庚子', '十一月初三', '11-3', '鼠', '大雪后', '四', 'Thu', '4', 'Thursday', '351', '51', '祭祀.求医.破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201218', '0', '工作日', '庚子', '十一月初四', '11-4', '鼠', '大雪后', '五', 'Fri', '5', 'Friday', '352', '51', '祭祀.祈福.斋醮.出行.冠笄.安机械.移徙.入宅.安香.安床.除服.成服.移柩.启攒', '开光.栽种.治病.安门.作灶', null);
INSERT INTO `t_calendar` VALUES ('20201219', '1', '假日', '庚子', '十一月初五', '11-5', '鼠', '大雪后', '六', 'Sat', '6', 'Saturday', '353', '51', '塑绘.斋醮.出行.拆卸.解除.修造.移徙.造船.入殓.除服.成服.移柩.启攒.修坟.立碑.谢土', null, null);
INSERT INTO `t_calendar` VALUES ('20201220', '1', '假日', '庚子', '十一月初六', '11-6', '鼠', '大雪后', '日', 'Sun', '7', 'Sunday', '354', '51', '祭祀.沐浴.安床.纳财.畋猎.捕捉', '开市.破土', null);
INSERT INTO `t_calendar` VALUES ('20201221', '0', '工作日', '庚子', '十一月初七', '11-7', '鼠', '大雪后', '一', 'Mon', '1', 'Monday', '355', '52', '订盟.纳采.祭祀.祈福.修造.动土.上梁.破土', '嫁娶.作灶', null);
INSERT INTO `t_calendar` VALUES ('20201222', '0', '工作日', '庚子', '十一月初八', '11-8', '鼠', '冬至', '二', 'Tue', '2', 'Tuesday', '356', '52', '出行.沐浴.理发.补垣.塞穴', '入宅.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201223', '0', '工作日', '庚子', '十一月初九', '11-9', '鼠', '冬至后', '三', 'Wed', '3', 'Wednesday', '357', '52', '教牛马.余事勿取', '入宅.动土.破土.余事勿取', null);
INSERT INTO `t_calendar` VALUES ('20201224', '0', '工作日', '庚子', '十一月初十', '11-10', '鼠', '冬至后', '四', 'Thu', '4', 'Thursday', '358', '52', '嫁娶.出行.求医.治病.祭祀.祈福.上梁.纳畜', '开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201225', '0', '工作日', '庚子', '十一月十一', '11-11', '鼠', '冬至后', '五', 'Fri', '5', 'Friday', '359', '52', '开市.立券.开光.解除.安机械.上梁.启攒.安葬', '嫁娶.祈福', null);
INSERT INTO `t_calendar` VALUES ('20201226', '1', '假日', '庚子', '十一月十二', '11-12', '鼠', '冬至后', '六', 'Sat', '6', 'Saturday', '360', '52', '平治道涂.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201227', '1', '假日', '庚子', '十一月十三', '11-13', '鼠', '冬至后', '日', 'Sun', '7', 'Sunday', '361', '52', '求嗣.斋醮.塑绘.订盟.纳采.出火.拆卸.修造.动土.造桥.安机械.栽种.纳畜.牧养.入殓.除服.成服.移柩.破土.安葬', '开市.嫁娶', null);
INSERT INTO `t_calendar` VALUES ('20201228', '0', '工作日', '庚子', '十一月十四', '11-14', '鼠', '冬至后', '一', 'Mon', '1', 'Monday', '362', '53', '嫁娶.订盟.纳采.祭祀.祈福.修造.动土.移徙.入宅', '开市.安葬', null);
INSERT INTO `t_calendar` VALUES ('20201229', '0', '工作日', '庚子', '十一月十五', '11-15', '鼠', '冬至后', '二', 'Tue', '2', 'Tuesday', '363', '53', '治病.破屋.坏垣.余事勿取', '诸事不宜', null);
INSERT INTO `t_calendar` VALUES ('20201230', '0', '工作日', '庚子', '十一月十六', '11-16', '鼠', '冬至后', '三', 'Wed', '3', 'Wednesday', '364', '53', '祭祀.祈福.求嗣.斋醮.开光.入学.订盟.冠笄.伐木.修造.动土.起基.放水.交易.开池', '造桥.安门.理发.造庙.栽种.作灶', null);
INSERT INTO `t_calendar` VALUES ('20201231', '0', '工作日', '庚子', '十一月十七', '11-17', '鼠', '冬至后', '四', 'Thu', '4', 'Thursday', '365', '53', '解除.坏垣.余事勿取', '诸事不宜', null);
